import { useState } from "react";
import { useDispatch, useSelector } from "react-redux";
import { termsPop } from "../../store/popupSlice";

const TermsPop = () => {
    const dispatch = useDispatch();
    const popup = useSelector((state)=>state.popup);
    const [tab, setTab] = useState(["개인정보취급방침","이메일 무단 수집 거부","개인정보수집","이용약관"]);
    const [tabOn, setTabOn] = useState(0);

    //팝업닫기
    const closePopHandler = () => {
        dispatch(termsPop(false));
    };

    return(
        <div className="flex_center pop_wrap terms_pop">
            <div className="dim" onClick={closePopHandler}></div>
            <div className="pop_cont">
                <button type="button" className="btn_close" onClick={closePopHandler}>닫기버튼</button>
                <div className="pop_tit">
                    <div className="tit">서비스 약관</div>
                </div>
                <div className="scroll_wrap">
                    <div className="tab_box">
                        <ul className="flex">
                            {tab.map((cont,i)=>{
                                return(
                                    <li 
                                        key={i} 
                                        onClick={()=>{setTabOn(i)}}
                                        className={`${tabOn === i ? "on" : ""}`}
                                    >{cont}</li>
                                );
                            })}
                        </ul>
                    </div>
                    <div className="txt_box">
                        제 1 조 [목적]
                        본 약관은 주식회사 (이하 “회사”)이 제공하는 클라우드 방식의 다우오피스 서비스의 이용과 관련하여 회사와 이용자의 권리ㆍ의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

                        제 2 조 [용어의 정의]
                        본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
                        ①다우오피스 클라우드 공:유형 서비스: 이용자의 구성원들의 협업을 지원하는 클라우드 방식의 소프트웨어인 다우오피스(영문명 DaouOffice)를 이용할 수 있도록 지원하는 서비스(이하 "서비스")를 의미합니다.
                        ②이용자 : 본 약관에 따라 회사와 서비스 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 개인 또는 기업 을 의미합니다.
                        ③관리자 : 이용자의 소속 직원으로 이용자를 대표하여 구성원의 서비스 이용을 승인 및 개별 계정을 부여하고, 구성원의 서비스 이용에 대한 관리권한과 운영을 책임지는 자를 의미합니다.
                        ④구성원 : 관리자에 의해 이용자의 일원으로 승인 받아 관리자가 허용하는 범위 내에서 서비스를 이용하는 자를 의미합니다.
                        ⑤아이디(ID) : 이용자의 식별과 서비스 이용을 위하여 이용자가 정하고 회사가 승인하는 문자와 숫자의 조합을 의미합니다.
                        ⑥비밀번호 : 아이디(ID)와 일치된 이용자임을 확인하고, 이용자의 비밀을 보호하기 위해 이용자가 설정한 문자와 숫자의 조합을 의미합니다.
                        ⑦데이터 : 이용자가 입력하여 회사의 서버 내에 저장되는 자료(게시글, 기초자료, 회계자료, 전자문서, 사진, 메시지, 파일, 동영상, 음성, 음향 등) 및 그 자료들의 결합, 변형 또는 재 연산을 통하여 생성되는 부가 자료 일체를 의미합니다.
                        ⑧결제대행업체 : 이용자의 결제정보를 바탕으로 결제기관의 승인 처리를 대행하는 기관으로서 이용자의 각 결제수단에 대한 결제승인과 회사에 대한 서비스 이용요금 정산을 대행하는 기관을 말합니다.
                        ⑨1회성 요금 : 회사가 이용자에게 초기세팅 대행, 전자결재 양식 제작 대행 등의 용역을 제공하고 받는 대가, 전자세금계산서 발행 서비스 이용을 위한 충전 금액 또는 초기 설치비 등으로 1회만 과금하는 요금을 말합니다.


                        제 3 조 [약관의 게시와 개정]
                        ①회사는 본 약관의 내용을 이용자가 쉽게 알 수 있도록 홈페이지 초기화면 (www.daouoffice.com, 이하 “홈페이지”)에 게시합니다.
                        ②회사는 약관 규제에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자 보호에 관한 법률 등 관련법을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
                        ③회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 본 조 제1항의 방식에 따라 그 개정약관의 적용일자 7일 전부터 적용일자 전까지 공지합니다. 다만, 이용자의 권리 또는 의무에 관한 중요한 사항의 변경 또는 이용자에게 불리한 약관의 변경은 최소한 30일 전에 공지하고 이용자가 사전에 등록한 전자우편주소, 전화번호로 메일, 문자메세지 등의 전자적 수단을 통해 별도로 명확히 통지하도록 합니다.
                        ④회사가 본 조 제3항에 따라 개정약관을 공지 또는 통지하면서 이용자에게 약관 변경 적용일까지 거부의사를 표시하지 않으면 동의한 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 이용자가 명시적으로 거부의 의사표시를 하지 아니한 경우 이용자가 개정약관에 동의한 것으로 봅니다.
                        ⑤이용자는 개정된 약관에 대해 동의하지 않을 권리가 있으며 이용자가 개정약관의 적용에 동의하지 않을 경우 이용자는 이용계약을 해지할 수 있습니다. 회사는 개정약관 적용에 동의하지 않는 이용자에 대해서는 기존 약관을 적용하되, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 이용계약을 해지할 수 있습니다.
                        ⑥본 약관은 이용자가 약관의 내용에 동의함으로써 효력이 발생하여 이용계약 종료일까지 적용됩니다. 단, 채권 또는 채무관계가 있을 경우에는 채권, 채무의 완료일까지로 규정합니다.

                        제 4 조 [약관 외 준칙]
                        본 약관에서 정하지 않은 사항과 본 약관의 해석에 관하여는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률 및 기타 관계법령 또는 상관례에 따릅니다.

                        제 5 조 [이용계약 체결]
                        ①이용계약은 이용자가 약관의 내용에 대하여 동의를 한 다음 회사가 제시하는 양식과 절차에 따라 이용신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 단, 전단의 회사 승낙에도 불구하고 이용자는 서비스 이용요금을 선납하기 전까지는 서비스 이용을 개시할 수 없습니다.
                        ②회사는 이용자의 서비스 이용 신청에 대하여 서비스 이용 승낙을 원칙으로 합니다. 다만, 회사는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
                        1.이용자가 본 약관에 의하여 이전에 서비스 이용자격을 상실한 적이 있는 경우, 단 회사의 이용자 재가입 승낙을 얻을 경우에는 예외로 함.
                        2.실명이 아니거나 타인의 명의를 이용한 경우
                        3.허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
                        4.만 14세 미만의 신청자인 경우
                        5.이용자가 서비스의 정상적인 제공을 저해하거나 다른 이용자의 서비스 이용에 지장을 줄 것으로 예상되는 경우
                        6.이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
                        7.기타 회사가 관련법령 등을 기준으로 하여 명백하게 사회질서 및 미풍양속에 반할 우려가 있음을 인정하는 경우
                        8.제22조[계약해지] 제3항에 의하여 회사로부터 계약해지를 당한 이후 1년이 경과하지 않은 경우
                        ③제1항에 따른 신청에 있어 회사는 이용자의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청하거나 증빙자료를 요청할 수 있습니다.
                        ④회사는 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
                        ⑤이용자는 서비스 이용을 위해 허위 사실이 없는 진실된 정보를 제공하여야 하며, 회사는 제공하는 서비스 상품에 따라 필요한 경우 이용자에게 추가 정보를 요청할 수 있습니다.
                        ⑥회사와 이용자가 서비스 이용에 관하여 별도 계약을 체결한 경우, 해당 별도 계약이 본 약관에 우선하여 적용됩니다.

                        제 6 조 [개인정보 수집]
                        ①회사는 적법하고 공정한 수단에 의하여 이용계약의 성립 및 이행에 필요한 최소한의 개인정보를 수집합니다.
                        ②회사는 개인정보의 수집 시 관련법규에 따라 개인정보 처리방침에 그 수집범위 및 목적을 사전 고지합니다.
                        ③회사는 서비스 화면에서 회사가 수집한 개인정보의 수집, 이용 또는 제공에 대한 동의를 철회 할 수 있도록 필요한 조치를 취해야 합니다.

                        제 7 조 [개인정보보호 의무]
                        ①회사는 개인정보보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관계 법령이 정하는 바에 따라 이용자의 개인정보를 보호하기 위해 노력합니다.
                        ②개인정보의 보호 및 이용에 대해서는 관련법 및 회사의 개인정보 처리방침이 적용됩니다. 다만, 회사의 공식 사이트 이외의 링크된 사이트에서는 회사의 개인정보 처리방침이 적용되지 않습니다.

                        제 8 조 [이용자의 아이디 및 비밀번호의 관리에 대한 의무]
                        ①이용자의 아이디와 비밀번호에 관한 관리책임은 이용자에게 있으며 이를 제3자가 이용하도록 하여서는 안 됩니다. 이용자(관리자, 구성원 포함)의 고의 또는 관리소홀 등의 과실로 인하여 아이디 또는 비밀번호가 유출되어 발생한 제3자의 도용, 부정사용 등에 대해서 회사는 책임을 지지 않습니다.
                        ②이용자는 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 회사에 통지하고 회사의 안내에 따라야 하며, 회사에 제3자 도용, 부정사용 사실을 통지하지 않거나 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대해서 회사는 책임을 지지 않습니다.
                        ③회사는 이용자의 아이디가 개인정보 유출 우려가 있거나 반사회적 또는 미풍양속에 어긋나거나 회사 또는 회사의 운영자로 오인할 우려가 있는 경우 해당 아이디의 활용을 제한할 수 있습니다.

                        제 9 조 [이용자의 정보 변경]
                        ①이용자는 관리자 페이지 화면을 통하여 언제든지 이용자 정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 아이디, 비밀번호 기타 관리자 계정에 관한 정보(이하 “관리자 정보등”)는 회사의 별도 승낙이 없는 한 수정이 불가능합니다.
                        ②이용자는 관리자 정보등을 변경하려는 경우 유선연락 및 전자우편을 통하여 변경사항을 고지하여야 하며, 변경사항 미수정 또는 미통지로 인하여 발생한 이용자의 불이익에 대해서는 회사는 책임을 지지 않습니다.

                        제 10 조 [이용자에 대한 통지]
                        ①회사는 본 약관에 별도 규정이 없는 한 이용자가 등록한 전자우편주소, 휴대전화번호로 이메일, 문자메시지 등 기타 통신수단을 이용하여 이용자에게 통지할 수 있습니다. 이용자가 전자우편주소, 휴대전화번호 정보를 허위로 제출 또는 등록하거나, 변경된 정보를 수정 또는 회사에 고지하지 않은 경우 회사는 이용자가 사전에 제출 또는 등록한 정보로 발송한 때에 이용자에게 도달한 것으로 합니다.
                        ②회사는 전체에 대한 통지의 경우 7일 이상 서비스 공지사항에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.

                        제 11 조 [회사의 의무]
                        ①회사는 관련법과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
                        ②회사는 이용자가 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보 처리방침을 공시하고 준수합니다.
                        ③회사는 서비스 제공과 관련하여 알고 있는 이용자의 개인정보를 이용자의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 다만, 관계법령에 의한 관계기관으로부터의 요청 등 법률의 규정에 따른 적법한 절차에 의한 경우에는 그러하지 않습니다.
                        ④회사는 이용자에게 제공하는 서비스를 연중 1일 24시간 계속적이고 안정적으로 제공하며, 설비에 장애가 생기거나 멸실 되었을 때 지체 없이 이를 수리 또는 복구합니다. 다만, 회사의 업무상•기술상의 사유 또는 천재지변이나 비상사태 등 부득이한 경우에는 서비스를 일시 중단하거나 영구 중지할 수 있으며, 이러한 경우, 회사는 홈페이지 게시, 유선연락, 문자메세지, 전자우편 등을 통해 사전 또는 사후적으로 이를 고지합니다.
                        ⑤회사는 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정할 경우에는 즉시 처리하여야 합니다. 다만, 즉시 처리가 곤란한 경우는 이용자에게 그 사유와 처리일정을 전자메일 등으로 통보하여야 합니다.

                        제 12 조 [이용자의 의무]
                        ①이용자는 서비스 이용의 대가로 회사가 정한 서비스 이용요금을 지정된 일자를 준수하여 납입하여야 합니다.
                        ②이용자는 다음 행위를 하여서는 안 됩니다.
                        1.서비스 이용 신청 또는 서비스 내용 변경 시 허위내용을 등록하는 행위
                        2.타인의 정보나 명의를 도용하거나 부정하게 사용하는 행위
                        3.다른 이용자의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
                        4.회사가 게시한 정보를 변경하거나 제3자에게 제공하는 행위
                        5.제3자의 코드 ∙ 파일 ∙ 프로그램을 포함하고 있는 자료를 무단으로 게시하거나 메일로 발송하는 행위 기타 회사 또는 제3자의 지식재산권을 침해하는 행위
                        6.회사 또는 제3자의 명예를 손상시키거나 업무를 방해하는 행위
                        7.외설 ∙ 폭력적 ∙ 비방적인 내용 기타 풍기문란을 조장하거나 공서양속에 반하는 내용(어린이에게 유해하거나 제3자의 사생활을 침해하는 내용을 포함합니다) 또는 수신자의 동의 없이 발송하는 광고성 내용[정크메일(junk mail), 스팸메일(spam mail), 행운의 편지(chain letters), 피라미드 조직에 가입할 것을 권유하는 내용을 포함합니다]의 메시지, 팩스, 음성, 메일, 정보를 서비스에 공개 또는 게시하거나 제3자에게 전송하는 행위
                        8.회사의 동의 없이 본 약관의 목적 범위를 벗어나 영리를 목적으로 서비스를 이용하는 행위
                        9.컴퓨터 소프트웨어 ∙ 하드웨어 ∙ 전기통신 장비의 정상적인 가동을 방해 ∙ 파괴할 목적으로 고안된 소프트웨어 바이러스, 악성코드 등 관련 법령에 의하여 전송 또는 게시가 금지되는 정보를 이용 또는 전송하는 행위
                        10.기타 불법적이거나 부당한 행위
                        ③이용자는 회사의 명시적인 동의가 없는 한 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도, 증여, 담보로 제공하는 등 기타 이와 유사한 행위를 할 수 없습니다.
                        ④이용자는 허용되지 않는 침입자로부터 안전하게 보호받을 수 있도록 시스템 운영과 관련한 정기적인 백신프로그램 등의 보안 업데이트를 하여야 하며, 이를 소홀히 하여 발생한 보안 사고, 손해 등에 대하여 회사는 책임을 지지 않습니다.
                        ⑤이용자는 서비스 이용 관련하여 전자우편 내용, 기안서 등의 각종 데이터 등에 대해 별도로 상시 저장할 의무가 있으며, 이를 소홀히 하여 발생한 정보의 유출, 누락 또는 자료의 손실에 대해 회사는 책임을 지지 않습니다.
                        ⑥이용자는 관계법, 본 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안 됩니다.
                        ⑦이용자는 스팸 또는 피싱 내용의 메일, 메시지, 팩스, 음성(이하 “불법스팸”) 전송 등 불법행위를 하거나 전기통신사업법 등 관련 법령을 준수하지 않아 발생하는 모든 민 ∙ 형사상의 책임을 부담합니다. 회사는 이용자가 불법스팸을 전송한 사실을 확인한 경우, 한국인터넷진흥원 불법스팸대응센터에 관련 자료를 첨부하여 신고할 수 있습니다.
                    </div>
                </div>
            </div>
        </div>
    );
};

export default TermsPop;