import { useEffect, useState } from "react";
import { useDispatch, useSelector } from "react-redux";
import axios from "axios";
import { enum_api_uri } from "../../config/enum";
import * as CF from "../../config/function";
import { termsPop, confirmPop, termsCheckList } from "../../store/popupSlice";
import ConfirmPop from "./ConfirmPop";


const TermsPop = () => {
    const dispatch = useDispatch();
    const popup = useSelector((state)=>state.popup);
    const policy_cont = enum_api_uri.policy_cont;
    const [confirm, setConfirm] = useState(false);
    const [terms, setTerms] = useState({});


    // Confirm팝업 닫힐때
    useEffect(()=>{
        if(popup.confirmPop === false){
            setConfirm(false);
        }
    },[popup.confirmPop]);


    //팝업닫기
    const closePopHandler = () => {
        dispatch(termsPop({termsPop:false,termsPopIdx:null}));
    };


    //약관내용 가져오기
    const getTerms = () => {
        axios.get(`${policy_cont.replace(":policy_type",popup.termsPopIdx)}`)
        .then((res)=>{
            if(res.status === 200){
                let data = res.data;
                setTerms({...data});
            }
        })
        .catch((error) => {
            const err_msg = CF.errorMsgHandler(error);
            dispatch(confirmPop({
                confirmPop:true,
                confirmPopTit:'알림',
                confirmPopTxt: err_msg,
                confirmPopBtn:1,
            }));
            setConfirm(true);
        });
    }


    useEffect(()=>{
        //랜딩 사소한 1%, 소개팅신청 - 광고성 수신 동의서
        if(popup.termsPopIdx === 5){
            const newTerms = {
                subject: '광고성 수신 동의서',
                contents_p: `[선택]광고성 메시지 수신 동의서
                사소한 (이하 "회사")
                
                고객 동의서
                
                수집 및 이용 목적
                
                회사는 고객에게 데이팅 서비스와 관련된 다양한 정보 및 혜택을 제공하기 위해 광고성 메시지를 발송합니다.
                광고성 메시지는 카카오톡,카카오 채널, SMS, 이메일, 앱 푸시 알림 등의 방법으로 전달될 수 있습니다.
                수집 항목
                
                ▪️ 수집항목
                성명, 생년월일, 성별, 휴대전화번호, 지역,서비스 이용 기록
                이용 기간
                
                광고성 메시지 수신 동의일로부터 고객의 수신 거부 의사 표시 시까지
                동의 거부 권리
                
                고객은 언제든지 광고성 메시지 수신을 거부할 수 있습니다.
                수신 거부를 원하는 경우, SMS 내 수신 거부 링크를 클릭하거나 고객센터로 연락하시면 됩니다.
                수신 거부 이후에도 서비스 관련 필수 공지사항은 별도로 발송될 수 있습니다.
                동의 여부`
            };
            setTerms(newTerms);
        }
        //랜딩 사소한 1% - 개인정보 보호정책 동의
        else if(popup.termsPopIdx === 6){
            const newTerms = {
                subject: '개인정보 보호정책 동의',
                contents_p: `제1장 총칙

                제1조 (목적) 이 약관은 사소한(이하 “회사”라 합니다)가 모바일 기기를 통해 제공하는 소개팅 서비스 및 이에 부수하는 네트워크, 웹사이트, 기타 서비스(이하 “서비스”라 합니다)의 이용에 대한 회사와 서비스 이용자의 권리ㆍ의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
                
                제2조 (용어의 정의) ① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
                1. “회사”라 함은 모바일 기기를 통하여 서비스를 제공하는 사업자를 의미합니다.
                2. “회원”이란 이 약관에 따라 이용계약을 체결하고, 회사가 제공하는 서비스를 이용하는 자를 의미합니다.
                3. “임시회원”이란 일부 정보만 제공하고 회사가 제공하는 서비스의 일부만 이용하는 자를 의미합니다.
                4. “모바일 기기”란 콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는 기기로서, 휴대폰, 스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다.
                5. “계정정보”란 회원의 회원번호와 외부계정정보, 기기정보, 별명, 프로필 사진, 친구목록 등 회원이 회사에 제공한 정보와 이용요금 결제 정보 등을 통칭합니다.
                6. “콘텐츠”란 모바일 기기로 이용할 수 있도록 회사가 서비스 제공과 관련하여 디지털 방식으로 제작한 유료 또는 무료의 내용물 일체를 의미합니다.
                7. “오픈마켓”이란 모바일 기기에서 소개팅 콘텐츠를 설치하고 결제할 수 있도록 구축된 전자상거래 환경을 의미합니다.
                8. “애플리케이션”이란 회사가 제공하는 서비스를 이용하기 위하여 모바일 기기를 통해 다운로드 받거나 설치하여 사용하는 프로그램 일체를 의미합니다.
                9 . “소개팅서비스”라 함은 회사가 제공하는 서비스의 하나로서 회원이 모바일 기기에서 실행하는 소개팅 및 이에 부수하는 서비스를 의미합니다.
                ② 이 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지 아니한 것은 일반적인 상 관례에 따릅니다.
                
                제3조 (회사정보 등의 제공) 회사는 다음 각 호의 사항을 회원이 알아보기 쉽도록 소개팅 서비스 내에 표시합니다. 다만, 개인정보처리방침과 약관은 회원이 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
                1. 상호 및 대표자의 성명
                2. 영업소 소재지 주소(회원의 불만을 처리할 수 있는 곳의 주소를 포함한다)
                3. 전화번호, 전자우편주소
                4. 사업자 등록번호
                5. 통신판매업 신고번호
                6. 개인정보처리방침
                7. 서비스 이용약관
                
                제4조 (약관의 효력 및 변경) ① 회사는 이 약관의 내용을 회원이 알 수 있도록 소개팅서비스 내 또는 그 연결화면에 게시합니다.
                ② 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7일 이전부터 소개팅서비스 내 또는 그 연결화면에 게시하여 회원에게 공지합니다. 이 경우 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.
                ③ 회사가 약관을 개정할 경우 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를 확인합니다. 회사는 제2항의 공지를 할 경우 회원이 개정약관에 대해 동의 또는 거부의 의사표시를 하지 않으면 동의한 것으로 볼 수 있다는 내용도 함께 공지 또는 통지를 하며, 회원이 이 약관 시행일까지 거부의 의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수 있습니다. 회원이 개정약관에 대해 동의하지 않는 경우 회사 또는 회원은 서비스 이용계약을 해지할 수 있습니다.
                ④ 회사는 회원이 회사와 이 약관의 내용에 관하여 질의 및 응답을 할 수 있도록 조치를 취합니다.
                ⑤ 회사는 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」,「정보통신망이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업진흥법」 등 관련 법령에 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
                
                제5조 (이용계약의 체결 및 적용) ① 이용계약은 회원이 되고자 하는 자(이하 “신청자”라 합니다.)가 이 약관의 내용에 대하여 동의를 한 다음 서비스 이용 신청을 하고, 회사가 그 신청에 대해서 승낙함으로써 체결됩니다.
                ② 회사는 신청자의 신청에 대하여 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각 호의 어느 하나에 해당하는 이용 신청에 대해서는 승낙을 거절할 수 있습니다.
                1. 이용신청서 내용을 허위로 기재하거나 이용신청 요건을 충족하지 못한 경우
                2. 회사가 서비스를 제공하지 않은 국가에서 비정상적이거나 우회적인 방법을 통해 서비스를 이용하는 경우
                3. 사회의 안녕과 질서 또는 미풍양속을 저해할 목적으로 신청한 경우
                4. 부정한 용도로 소개팅서비스를 이용하고자 하는 경우
                5. 영리를 추구할 목적으로 소개팅서비스를 이용하고자 하는 경우
                6. 그 밖에 각 호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우
                ③ 회사는 다음 각 호의 어느 하나에 해당하는 경우 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
                1. 회사의 설비에 여유가 없거나, 특정 모바일 기기의 지원이 어렵거나, 기술적 장애가 있는 경우
                2. 서비스 상의 장애 또는 서비스 이용요금, 결제수단의 장애가 발생한 경우
                3. 그 밖의 각 호에 준하는 사유로서 이용신청의 승낙이 어렵다고 판단되는 경우
                
                제6조 (약관 외 준칙) 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「전자상거래 등에서의 소비자보호에 관한 법률」,「약관의 규제에 관한 법률」,「정보통신망이용촉진 및 정보보호 등에 관한 법률」,「콘텐츠산업진흥법」 등 관련 법령 또는 상 관례에 따릅니다.
                
                제7조 (운영정책) ① 약관을 적용하기 위하여 필요한 사항과 약관에서 구체적 범위를 정하여 위임한 사항을 소개팅서비스 운영정책(이하 “운영정책”이라 합니다)으로 정할 수 있습니다.
                ② 회사는 운영정책의 내용을 회원이 알 수 있도록 소개팅서비스 내 또는 그 연결화면에 게시합니다.
                ③ 운영정책을 개정하는 경우에는 제4조 제2항의 절차에 따릅니다. 다만, 운영정책 개정내용이 다음 각 호의 어느 하나에 해당하는 경우에는 제2항의 방법으로 사전에 공지합니다.
                1. 약관에서 구체적으로 범위를 정하여 위임한 사항을 개정하는 경우
                2. 회원의 권리·의무와 관련 없는 사항을 개정하는 경우
                3. 운영정책의 내용이 약관에서 정한 내용과 근본적으로 다르지 않고 회원이 예측할 수 있는 범위 내에서 운영정책을 개정하는 경우
                
                제2장 개인정보 관리
                
                제8조 (개인정보의 보호 및 사용) ① 회사는 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력하며, 개인정보의 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보처리방침에 따릅니다. 다만, 회사가 제공하는 서비스 이외의 링크된 서비스에서는 회사의 개인정보처리방침이 적용되지 않습니다.
                ② 서비스의 특성에 따라 회원의 개인정보(성명, 사진, 주소, 전화번호)와 자신을 소개하는 내용이 이성 회원에게 제공될 수 있습니다.
                ③ 회사는 관련 법령에 의해 관련 국가기관 등의 요청이 있는 경우 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보를 본인의 동의 없이 타인에게 제공하지 않습니다.
                ④ 회사는 회원의 귀책사유로 개인정보가 유출되어 발생한 피해에 대하여 책임을 지지 않습니다.
                
                제3장 이용계약 당사자의 의무
                
                제9조 (회사의 의무) ① 회사는 관련 법령, 이 약관에서 정하는 권리의 행사 및 의무의 이행을 신의에 따라 성실하게 준수합니다.
                ② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다.
                ③ 회사는 계속적이고 안정적인 서비스의 제공을 위하여 서비스 개선을 하던 중 설비에 장애가 생기거나 데이터 등이 멸실,훼손된 때에는 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 장애나 결함 등 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다.
                
                제10조 (회원의 의무) ① 회원은 회사에서 제공하는 서비스의 이용과 관련하여 다음 각 호에 해당하는 행위를 해서는 아니 됩니다.
                1. 이용신청 또는 회원 정보 변경 시 허위사실을 기재하는 행위
                2. 회사가 제공하지 않는 서비스나 비정상적인 방법을 통해 사이버 자산을 매매 또는 증여하거나, 이를 취득하여 이용하는 행위
                3. 회사의 직원이나 운영자를 가장하거나 타인의 명의를 도용하여 글을 게시하거나 메일을 발송하는 행위, 타인으로 가장하거나 타인과의 관계를 허위로 명시하는 행위
                4. 타인의 신용카드 유/무선 전화, 은행 계좌 등을 도용하여 유료 콘텐츠를 구매하는 행위, 다른 회원의 ID 및 비밀번호를 부정사용하는 행위
                5. 다른 회원의 개인정보를 무단으로 수집, 저장,게시 또는 유포하는 행위
                6. 도박 등 사행행위를 하거나 유도하는 행위, 음란,저속한 정보를 교류,게재하거나 음란 사이트를 연결(링크)하는 행위, 수치심,혐오감 또는 공포심을 일으키는 말,소리,글,그림,사진 또는 영상을 타인에게 전송 또는 유포하는 행위 등 서비스를 불건전하게 이용하는 행위
                7. 서비스를 무단으로 영리, 영업, 광고, 홍보, 정치활동, 선거운동 등 본래의 용도 이외의 용도로 이용하는 행위
                8. 회사의 서비스를 이용하여 얻은 정보를 무단으로 복제,유통,조장하거나 상업적으로 이용하는 행위, 알려지거나 알려지지 않은 버그를 악용하여 서비스를 이용하는 행위
                9. 타인을 기망하여 이득을 취하는 행위, 회사의 서비스의 이용과 관련하여 타인에게 피해를 입히는 행위
                10. 회사나 타인의 지적재산권 또는 초상권을 침해하는 행위, 타인의 명예를 훼손하거나 손해를 가하는 행위
                11. 법령에 의하여 전송 또는 게시가 금지된 정보(컴퓨터 프로그램)나 컴퓨터 소프트웨어,하드웨어 또는 전기통신장비의 정상적인 작동을 방해,파괴할 목적으로 고안된 바이러스,컴퓨터 코드,파일,프로그램 등을 고의로 전송,게시,유포 또는 사용하는 행위
                12. 회사로부터 특별한 권리를 부여 받지 않고 애플리케이션을 변경하거나, 애플리케이션에 다른 프로그램을 추가,삽입하거나, 서버를 해킹,역설계하거나, 소스 코드나 애플리케이션 데이터를 유출,변경하거나, 별도의 서버를 구축하거나, 웹사이트의 일부분을 임의로 변경,도용하여 회사를 사칭하는 행위
                13. 그 밖에 관련 법령에 위반되거나 선량한 풍속 기타 사회통념에 반하는 행위
                ② 회원의 계정 및 모바일 기기에 관한 관리 책임은 회원에게 있으며, 이를 타인이 이용하도록 하게 하여서는 안 됩니다. 모바일 기기의 관리 부실이나 타인에게 이용을 승낙함으로 인해 발생하는 손해에 대해서 회사는 책임을 지지 않습니다.
                ③ 회원은 각 오픈마켓에서 부정한 결제가 이루어지지 아니하도록 결제 비밀번호 기능을 설정하고 관리하여야 합니다. 회원의 부주의로 인하여 발생하는 손해에 대해 회사는 책임지지 않습니다
                ④ 회사는 다음 각 호의 행위의 구체적인 내용을 정할 수 있으며, 회원은 이를 따라야 합니다.
                1. 채팅내용과 방법
                2. 게시판이용 및 서비스이용 방법
                3. 카카오, 페이스북, 구글플러스 등 외부 모바일 플랫폼 제휴 서비스 정책
                
                
                제4장 서비스 이용 및 이용제한
                
                제11조 (서비스의 제공) ① 회사는 제5조의 규정에 따라 이용계약이 완료된 회원에게 그 즉시 서비스를 이용할 수 있도록 합니다. 다만, 일부 서비스의 경우 회사의 필요에 따라 지정된 일자부터 서비스를 개시할 수 있습니다.
                ② 회사는 회원에게 소개팅서비스를 제공할 때 이 약관에 정하고 있는 서비스를 포함하여 기타 부가적인 서비스를 함께 제공할 수 있습니다.
                ③ 회사는 회원의 등급을 구분하고 이용시간, 이용횟수, 제공 서비스의 범위 등을 세분화하여 이용에 차등을 둘 수 있습니다.
                
                제12조 (서비스의 이용) ① 소개팅서비스는 회사의 영업방침에 따라 정해진 시간 동안 제공합니다. 회사는 소개팅서비스 제공시간을 소개팅 애플리케이션 초기화면이나 소개팅서비스 공지사항에 적절한 방법으로 안내합니다.
                ② 제1항에도 불구하고 회사는 다음 각 호의 경우에는 서비스의 전부 또는 일부를 일시 정지할 수 있습니다. 이 경우 회사는 사전에 그 정지의 사유와 기간을 소개팅 애플리케이션 초기화면이나 소개팅서비스 공지사항 등에 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우 사후에 공지할 수 있습니다.
                1. 시스템 정기점검, 서버의 증설 및 교체, 네트워크의 불안정 등의 시스템 운영상 필요한 경우
                2. 정전, 서비스 설비의 장애, 서비스 이용폭주, 기간통신사업자의 설비 보수 또는 점검 등으로 인하여 정상적인 서비스 제공이 불가능한 경우
                3. 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태 등 회사가 통제할 수 없는 상황이 발생한 경우
                ③ 회사는 모바일 기기를 위한 전용 애플리케이션 또는 네트워크를 이용하여 서비스를 제공합니다. 회원은 애플리케이션을 다운로드하여 설치하거나 네트워크를 이용하여 무료 또는 유료로 서비스를 이용할 수 있습니다.
                ④ 유료 콘텐츠의 경우에는 해당 서비스에 명시된 요금을 지급하여야 이용할 수 있습니다. 네트워크를 통해 애플리케이션을 다운로드하거나 서비스를 이용하는 경우에는 가입한 이동통신사에서 정한 별도의 요금이 발생할 수 있습니다.
                ⑤ 다운로드하여 설치한 애플리케이션 또는 네트워크를 통해 이용하는 서비스의 경우에는 모바일 기기 또는 이동통신사의 특성에 맞도록 제공됩니다. 모바일 기기의 변경,번호 변경 또는 해외 로밍의 경우에는 콘텐츠의 전부 또는 일부의 이용이 불가능할 수 있으며, 이 경우 회사는 책임을 지지 않습니다.
                ⑥ 다운로드하여 설치한 애플리케이션 또는 네트워크를 통해 이용하는 서비스의 경우에는 백그라운드 작업이 진행될 수 있습니다. 이 경우 모바일 기기 또는 이동통신사의 특성에 맞도록 추가요금이 발생할 수 있으며 이와 관련하여 회사는 책임을 지지 않습니다.
                
                제13조 (서비스의 변경 및 중단) ① 회사는 원활한 소개팅서비스 제공을 위해 운영상 또는 기술상의 필요에 따라 서비스를 변경할 수 있으며, 변경 전에 해당 내용을 소개팅서비스 내에 공지합니다. 다만, 버그,오류 등의 수정이나 긴급 업데이트 등 부득이하게 변경할 필요가 있는 경우 또는 중대한 변경에 해당하지 않는 경우에는 사후에 공지할 수 있습니다.
                ② 회사는 영업양도,분할,합병 등에 따른 영업의 폐지, 소개팅제공의 계약만료, 당해 소개팅서비스의 현저한 수익 악화 등 경영상의 중대한 사유로 인해 소개팅서비스를 지속하기 어려운 경우에는 서비스 전부를 중단할 수 있습니다. 이 경우 중단일자 30일 이전까지 중단일자,중단사유,보상조건 등을 소개팅 애플리케이션 초기화면 또는 그 연결화면을 통해 공지하고 제27조 제1항의 방법으로 회원에게 통지합니다.
                
                제14조 (정보의 수집 등) ① 회사는 회원간에 이루어지는 채팅 내용을 저장,보관할 수 있으며 이 정보는 회사만이 보유합니다. 회사는 회원간의 분쟁 조정, 민원 처리 또는 소개팅 질서의 유지를 위한 경우에 한하여, 제3자는 법령에 따라 권한이 부여된 경우에 한하여 이 정보를 열람할 수 있습니다.
                ② 회사 또는 제3자가 제1항에 따라 채팅 정보를 열람할 경우 회사는 사전에 열람의 사유 및 범위를 해당 회원에게 고지합니다. 다만, 제10조 제1항에 따른 금지행위의 조사,처리,확인 또는 그 행위로 인한 피해 구제와 관련하여 이 정보를 열람해야 할 경우에는 사후에 고지할 수 있습니다.
                ③ 회사는 서비스의 원활하고 안정적인 운영 및 서비스 품질의 개선을 위하여 회원의 개인정보를 제외한 회원의 모바일 기기 정보(설정,사양,운영체제, 버전 등)를 수집 , 활용할 수 있습니다.
                ④ 회사는 서비스 개선 및 회원 대상 서비스 소개 등을 위한 목적으로 회원에게 추가정보를 요청할 수 있습니다. 이 요청에 대해 회원은 승낙하거나 거절할 수 있으며, 회사가 이 요청을 할 경우에는 회원이 이 요청을 거절할 수 있다는 뜻을 함께 고지합니다.
                
                제15조 (광고의 제공) ① 회사는 서비스의 운영과 관련하여 소개팅서비스 내에 광고를 게재할 수 있습니다. 또한 수신에 동의한 회원에 한하여 전자우편, 문자서비스(LMS/SMS), 푸시메시지(Push Notification) 등의 방법으로 광고성 정보를 전송할 수 있습니다. 이 경우 회원은 언제든지 수신을 거절할 수 있으며, 회사는 회원의 수신 거절 시 광고성 정보를 발송하지 아니합니다.
                ② 회사가 제공하는 서비스 중의 배너 또는 링크 등을 통해 타인이 제공하는 광고나 서비스에 연결될 수 있습니다.
                ③ 제2항에 따라 타인이 제공하는 광고나 서비스에 연결될 경우 해당 영역에서 제공하는 서비스는 회사의 서비스 영역이 아니므로 회사가 신뢰성, 안정성 등을 보장하지 않으며, 그로 인한 회원의 손해에 대하여도 회사는 책임을 지지 않습니다. 다만, 회사가 고의 또는 중과실로 손해의 발생을 용이하게 하거나 손해 방지를 위한 조치를 취하지 아니한 경우에는 그러하지 아니합니다.
                
                제16조 (저작권 등의 귀속) ① 회사가 제작한 소개팅서비스 내의 콘텐츠에 대한 저작권과 기타 지적재산권은 회사에 귀속합니다.
                ② 회원은 회사가 제공하는 소개팅서비스를 이용하여 얻은 정보 중에서 회사 또는 제공업체에 지적재산권이 귀속된 정보를 회사 또는 제공업체의 사전 동의 없이 복제,전송 등의 방법(편집, 공표, 공연, 배포, 방송, 2차적 저작물 작성 등을 포함합니다. 이하 같습니다)에 의하여 영리목적으로 이용하거나 타인에게 이용하게 하여서는 안 됩니다.
                ③ 회원은 소개팅 내에서 보여지거나 소개팅서비스와 관련하여 회원 또는 다른 이용자가 소개팅 애플리케이션 또는 소개팅서비스를 통해 업로드 또는 전송하는 대화 텍스트를 포함한 커뮤니케이션, 이미지, 사운드 및 모든 자료 및 정보(이하 “이용자 콘텐츠”라 합니다.)에 대하여 회사가 다음과 같은 방법과 조건으로 이용하는 것을 허락합니다.
                1. 해당 이용자 콘텐츠를 이용, 편집 형식의 변경 및 기타 변형하는 것(공표, 복제, 공연, 전송, 배포, 방송, 2차적 저작물 작성 등 어떠한 형태로든 이용 가능하며, 이용기간과 지역에는 제한이 없음)
                2. 이용자 콘텐츠를 제작한 이용자의 사전 동의 없이 거래를 목적으로 이용자 콘텐츠를 판매, 대여, 양도 행위를 하지 않음
                ④ 소개팅 내에서 보여지지 않고 소개팅서비스와 일체화되지 않은 회원의 이용자 콘텐츠(예컨대, 일반게시판 등에서의 게시물)에 대하여 회사는 회원의 명시적인 동의가 없이 이용하지 않으며, 회원은 언제든지 이러한 이용자 콘텐츠를 삭제할 수 있습니다.
                ⑤ 회사는 회원이 게시하거나 등록하는 서비스 내의 게시물에 대해 제10조 제1항에 따른 금지행위에 해당된다고 판단되는 경우에는 사전 통지 없이 이를 삭제 또는 이동하거나 그 등록을 거절할 수 있습니다.
                ⑥ 회사가 운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 회원은 회사에 해당 정보의 삭제 또는 반박 내용의 게재를 요청할 수 있습니다. 이 경우 회사는 신속하게 필요한 조치를 취하고 이를 신청인에게 통지합니다.
                ⑦ 이 조는 회사가 소개팅서비스를 운영하는 동안 유효하며, 신청 이력 삭제 이후에도 지속적으로 적용됩니다.
                
                제17조 (유료 콘텐츠의 구매, 사용기간 및 이용) ① 소개팅서비스 내에서 회원이 구매한 유료 콘텐츠는 해당 애플리케이션을 다운로드 받거나 설치한 모바일 기기에서만 이용할 수 있습니다.
                ② 회원이 구매한 유료 콘텐츠의 이용기간은 구매 시 명시된 기간에 따릅니다. 다만, 제13조 제2항에 따라 서비스 중단이 이루어지는 경우 기간의 정함이 없는 유료 콘텐츠의 이용기간은 서비스 중단 공지 시 공지된 서비스의 중단일자까지로 합니다.
                
                제18조 (회원에 대한 서비스 이용제한) ① 회원은 제10조에 따른 회원의 의무를 위반하는 행위를 하여서는 안 되며, 해당 행위를 하는 경우에 회사는 다음 각 호의 구분에 따른 회원의 서비스 이용제한, 관련 정보(글, 사진, 영상 등) 삭제 및 기타의 조치를 포함한 이용제한 조치를 할 수 있습니다. 이용제한 조치가 이루어지는 구체적인 사유 및 절차는 제19조 제1항에 따라 개별 소개팅의 운영정책에서 정합니다.
                1. 일부 권한 제한 : 일정기간 채팅 등 일정 권한을 제한
                2. 회원 이용제한 : 일정기간 또는 영구히 회원의 소개팅서비스 이용을 제한
                ② 제1항의 이용제한이 정당한 경우에 회사는 이용제한으로 인하여 회원이 입은 손해를 배상하지 않습니다.
                ③ 회사는 다음 각 호의 사유에 대한 조사가 완료될 때까지 해당 계정의 서비스 이용을 정지할 수 있습니다.
                1. 계정이 해킹 또는 도용당했다는 정당한 신고가 접수된 경우
                2. 불법프로그램 사용자 또는 위법행위자로 의심되는 경우
                3. 그 밖에 각 호에 준하는 사유로 서비스 이용의 잠정조치가 필요한 경우
                ④ 제3항의 조사가 완료된 후, 유료 소개팅서비스의 경우에는 정지된 시간만큼 회원의 이용시간을 연장하거나 그에 상당하는 유료서비스 또는 캐쉬 등으로 보상합니다. 다만, 회원이 제3항 각 호의 사유에 해당하는 경우에는 그러하지 아니합니다.
                
                제19조 (이용제한 조치의 사유와 절차) ① 회사는 제18조 제1항에 따른 이용제한 조치의 구체적인 사유 및 절차를 제10조 제1항에 따른 금지행위의 내용,정도,횟수,결과 등을 고려하여 운영정책으로 정합니다.
                ② 회사가 제18조 제1항에서 정한 이용제한 조치를 하는 경우에는 다음 각 호의 사항을 회원에게 사전 통지합니다. 다만, 긴급히 조치할 필요가 있는 경우에는 사후에 통지할 수 있습니다.
                1. 이용제한 조치의 사유
                2. 이용제한 조치의 유형 및 기간
                3. 이용제한 조치에 대한 이의신청 방법
                
                제20조 (이용제한 조치에 대한 이의신청 절차) ① 회원이 회사의 이용제한 조치에 불복하고자 할 때에는 이 조치의 통지를 받은 날부터 14일 이내에 불복 이유를 기재한 이의 신청서를 서면, 전자우편 또는 이에 준하는 방법으로 회사에 제출하여야 합니다.
                ② 회사는 제1항의 이의신청서를 접수한 날부터 15일 이내에 불복 이유에 대하여 서면, 전자우편 또는 이에 준하는 방법으로 답변합니다. 다만, 회사는 이 기간 내에 답변이 어려운 경우에는 그 사유와 처리일정을 통지합니다.
                ③ 회사는 불복 이유가 타당한 경우에는 이에 따른 조치를 취합니다.
                
                제5장 청약철회, 과오납금의 환급 및 이용계약의 해지
                
                제21조 (대금결제) ① 콘텐츠에 대한 구매 대금의 부과와 납부는 원칙적으로 이동통신사나 오픈마켓 사업자 등에서 정하는 정책이나 방법에 따릅니다. 또한 각 결제수단별 한도가 회사나 오픈마켓 사업자가 정하는 정책 또는 정부의 방침에 따라 부여되거나 조정될 수 있습니다.
                ② 콘텐츠의 구매대금을 외화로 결제하는 경우에는 환율,수수료 등으로 인하여 실제 청구금액이 서비스의 상점 등에서 표시된 가격과 달라질 수 있습니다.
                
                제22조 (청약 철회 등) ① 회사와 유료 콘텐츠의 구매에 관한 계약을 체결한 회원은 구매계약일과 콘텐츠 이용 가능일 중 늦은 날부터 7일 이내에 별도의 수수료,위약금 등의 부담 없이 청약철회를 할 수 있습니다.
                ② 회원은 다음 각 호에 해당하는 경우에는 회사의 의사에 반하여 제1항에 따른 청약철회를 할 수 없습니다. 다만, 가분적 콘텐츠로 구성된 구매계약의 경우에는 가분적 콘텐츠 중 다음 각 호에 해당하지 아니하는 나머지 부분에 대하여는 그러하지 아니합니다.
                1. 구매 즉시 사용되거나 적용되는 유료 콘텐츠
                2. 추가혜택이 제공되는 경우에 그 추가 혜택이 사용된 콘텐츠
                3. 개봉행위를 사용으로 볼 수 있거나 개봉 시 효용이 결정되는 콘텐츠의 개봉행위가 있는 경우
                ③ 회사는 제2항 각 호의 규정에 따라 청약철회가 불가능한 콘텐츠의 경우에는 그 사실을 회원이 쉽게 알 수 있는 곳에 명확하게 표시하고, 해당 콘텐츠의 시험사용 상품을 제공(한시적 이용의 허용, 체험용 제공 등)하거나 이에 대한 제공이 곤란한 경우에는 콘텐츠에 관한 정보 제공함으로써 회원의 청약철회의 권리행사가 방해받지 아니하도록 조치합니다. 만약 회사가 이러한 조치를 하지 아니한 경우에는 제2항 각 호의 청약철회 제한사유에도
                ④ 회원은 제1항 및 제2항에도 불구하고 구매한 유료 콘텐츠의 내용이 표시,광고의 내용과 다르거나 구매계약의 내용과 다르게 이행된 경우에 해당 콘텐츠가 이용 가능하게 된 날부터 3개월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회를 할 수 있습니다.
                ⑤ 회원이 청약철회를 할 경우 회사는 플랫폼사업자 또는 오픈마켓 사업자를 통해 구매내역을 확인합니다. 또한 회사는 회원의 정당한 철회 사유를 확인하기 위해 회원에게서 제공받은 정보를 통해 회원에게 연락할 수 있으며, 추가적인 증빙을 요구할 수 있습니다.
                ⑥ 제1항부터 제4항까지의 규정에 따라 청약철회가 이루어질 경우 회사는 지체 없이 회원의 유료 콘텐츠를 회수하고 3영업일 이내에 대금을 환급합니다. 이 경우 회사가 환급을 지연한 때에는 그 지연기간에 대하여 「전자상거래 등에서의 소비자보호에 관한 법률」 및 같은 법 시행령 제21조의3에서 정하는 이율을 곱하여 산정한 지연이자를 지급합니다.
                ⑦ 미성년자가 모바일 기기에서 콘텐츠 구매계약을 체결하는 경우, 회사는 법정대리인의 동의가 없으면 미성년자 본인 또는 법정대리인이 그 계약을 취소할 수 있다는 내용을 고지하며, 미성년자가 법정대리인의 동의 없이 구매계약을 체결한 때에는 미성년자 본인 또는 법정대리인은 회사에 그 계약을 취소할 수 있습니다. 다만, 미성년자가 법정대리인이 범위를 정하여 처분을 허락한 재산으로 콘텐츠를 구매한 경우 또는 미성년자가 속임수로써 자기를 성년자로 믿게 하거나 법정대리인의 동의가 있는 것으로 믿게 한 경우에는 취소할 수 없습니다.
                ⑧ 콘텐츠 구매계약의 당사자가 미성년자인지 여부는 결제가 진행된 모바일 기기, 결제 실행자 정보, 결제 수단 명의자 등을 근거로 판단합니다. 또한 회사는 정당한 취소인지를 확인하기 위해 미성년자 및 법정대리인임을 증명할 수 있는 서류의 제출을 요청할 수 있습니다.
                
                제23조 (과오납금의 환급) ① 회사는 과오납금이 발생하는 경우 과오납금을 회원에게 환급합니다. 다만, 과오납금이 회사의 고의 또는 과실 없이 회원의 과실로 인하여 발생한 경우에는 그 환급에 소요되는 실제 비용은 합리적인 범위 내에서 회원이 부담합니다.
                ② 애플리케이션을 통한 결제는 오픈마켓 사업자가 제공하는 결제방식에 따르며, 결제 과정에서 과오납금이 발생하는 경우, 회사 또는 오픈마켓 사업자에게 환급을 요청하여야 합니다.
                ③ 애플리케이션의 다운로드 또는 네트워크 서비스의 이용으로 인해 발생한 통신요금(통화료, 데이터 통화료 등)은 환급 대상에서 제외될 수 있습니다.
                ④ 환급은 서비스를 이용하고 있는 모바일 기기의 운영체제 종류에 따라 각 오픈마켓 사업자 또는 회사의 환급정책에 따라 진행됩니다.
                ⑤ 회사는 과오납금의 환급을 처리하기 위해 회원에게서 제공받은 정보를 통해 회원에게 연락할 수 있으며, 필요한 정보의 제공을 요청할 수 있습니다. 회사는 회원으로부터 환급에 필요한 정보를 받은 날부터 3영업일 이내에 환급합니다.
                
                제24조 (계약 해지 등) ① 회원은 언제든지 서비스 이용을 원하지 않는 경우 신청 이력 삭제를 통해 이용계약을 해지할 수 있습니다. 신청 이력 삭제로 인해 회원이 소개팅서비스 내에서 보유한 소개팅이용정보는 모두 삭제되어 복구가 불가능하게 됩니다.
                ② 회사는 회원이 이 약관 및 그에 따른 운영정책, 서비스 정책에서 금지하는 행위를 하는 등 본 계약을 유지할 수 없는 중대한 사유가 있는 경우에는 상당한 기간 전에 최고하고 기간을 정하여 서비스 이용을 중지하거나 이용계약을 해지할 수 있습니다.
                ③ 제1항 및 제2항에 따른 환급 및 손해배상은 「콘텐츠이용자보호지침」에 따라 처리합니다.
                ④ 회사는 최근의 서비스 이용일부터 연속하여 1년 동안 회사의 서비스를 이용하지 않은 회원(이하 “휴면계정”이라 합니다)의 개인정보를 보호하기 위해 이용계약을 해지하고 회원의 개인정보 파기 등의 조치를 취할 수 있습니다. 이 경우 조치일 30일 전까지 계약해지, 개인정보 파기 등의 조치가 취해진다는 사실 및 파기될 개인정보 등을 회원에게 통지합니다.
                
                제6장 손해배상 및 면책조항 등
                
                제25조 (손해배상) ① 회사 또는 회원은 본 약관을 위반하여 상대방에게 손해를 입힌 경우에는 그 손해를 배상할 책임이 있습니다. 다만, 고의 또는 과실이 없는 경우에는 그러하지 아니 합니다
                ② 회사가 개별서비스 제공자와 제휴 계약을 맺고 회원에게 개별서비스를 제공하는 경우에 회원이 이 개별서비스 이용약관에 동의를 한 뒤 개별서비스 제공자의 고의 또는 과실로 인해 회원에게 손해가 발생한 경우에 그 손해에 대해서는 개별서비스 제공자가 책임을 집니다.
                
                제26조 (회사의 면책) ① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관하여 책임을 지지 않습니다.
                ② 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 기타 이에 준하는 사유로 발생한 손해에 대하여 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.
                ③ 회사는 회원의 고의 또는 과실로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다. 다만, 회원에게 부득이하거나 정당한 사유가 있는 경우에는 그러하지 아니합니다.
                ④ 회원이 서비스와 관련하여 게재한 정보나 자료 등의 신뢰성, 정확성 등에 대하여 회사는 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.
                ⑤ 회사는 회원이 다른 회원 또는 타인과 서비스를 매개로 발생한 거래나 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해에 대해 책임을 지지 않습니다.
                ⑥ 회사는 무료로 제공되는 서비스 이용과 관련하여 회원에게 발생한 손해에 대해서는 책임을 지지 않습니다. 그러나 회사의 고의 또는 중과실에 의한 경우에는 그러하지 아니합니다.
                ⑦ 회사는 회원이 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.
                ⑧ 회사는 회원이 모바일 기기 비밀번호, 오픈마켓 사업자가 제공하는 비밀번호 등을 관리하지 않아 발생하는 제3자 결제에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.
                ⑨ 회원이 모바일 기기의 변경, 모바일 기기의 번호 변경, 운영체제(OS) 버전의 변경, 해외 로밍, 통신사 변경 등으로 인해 콘텐츠 전부나 일부의 기능을 이용할 수 없는 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.
                ⑩ 회원이 회사가 제공하는 콘텐츠나 계정정보를 삭제한 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.
                ⑪ 회사는 임시회원이 서비스 이용으로 발생한 손해에 대해서는 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.
                
                제27조 (회원에 대한 통지) ① 회사가 회원에게 통지를 하는 경우 회원의 전자우편주소, 전자메모, 소개팅 서비스 내 쪽지, 문자메시지(LMS/SMS) 등으로 할 수 있습니다.
                ② 회사는 회원 전체에게 통지를 하는 경우 7일 이상 소개팅서비스 내에 게시하거나 팝업화면 등을 제시함으로써 제1항의 통지에 갈음할 수 있습니다.
                
                제28조 (재판권 및 준거법) 이 약관은 대한민국 법률에 따라 규율되고 해석됩니다. 회사와 회원 간에 발생한 분쟁으로 소송이 제기되는 경우에는 법령에 정한 절차에 따른 법원을 관할 법원으로 합니다.
                
                제29조 (회원의 고충처리 및 분쟁해결)
                ① 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는 방법을 소개팅서비스 내 또는 그 연결화면에 안내합니다. 회사는 이러한 회원의 의견이나 불만을 처리하기 위한 전담인력을 운영합니다.
                ② 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 합리적인 기간 내에 이를 신속하게 처리합니다. 다만, 처리에 장기간이 소요되는 경우에는 회원에게 장기간이 소요되는 사유와 처리일정을 소개팅서비스 내 공지하거나 제27조 제1항에 따라 통지합니다.
                ③ 회사와 회원 간에 분쟁이 발생하여 제3의 분쟁조정기관이 조정할 경우 회사는 이용제한 등 회원에게 조치한 사항을 성실히 증명하고, 조정기관의 조정에 따를 수 있습니다.
                
                
                
                사소한 개인정보 처리방침
                
                사소한(이하 ‘회사’라 합니다)은 개인정보 보호법 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립공개합니다.
                
                제1조(개인정보의 처리목적) 회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
                
                1. 홈페이지 회원 신청 및 관리
                회원 신청 의사 확인, 회원제 서비스 제공에 따른 본인 식별인증, 회원자격 유지 관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인, 각종 고지,통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
                2. 재화 또는 서비스 제공
                서비스 제공, 계약서, 청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 연령인증, 요금결제정산, 채권추심 등을 목적으로 개인정보를 처리합니다.
                3. 고충처리
                민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락통지, 처리결과 통보 등의 목적으로 개인정보를 처리합니다.
                
                제2조(개인정보의 처리 및 보유기간) ① 회사는 법령에 따른 개인정보 보유,이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유이용기간 내에서 개인정보를 처리,보유합니다.
                
                ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
                
                1. 서비스 회원 신청 및 관리 : ‘사소한’ 신청 이력 삭제시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지
                1) 관계 법령 위반에 따른 수사조사 등이 진행 중인 경우에는 해당 수사, 조사 종료 시까지
                2) 홈페이지 이용에 따른 채권 채무관계 잔존 시에는 해당 채권,채무관계 정산 시까지
                
                2. 재화 또는 서비스 제공 : 재화서비스 공급완료 및 요금결제, 정산 완료시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료 시까지
                1) 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시, 광고 계약내용 및 이행 등 거래에 관한 기록
                - 표시,광고에 관한 기록 : 6월
                - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년
                - 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
                2)「통신비밀보호법시행령」에 따른 통신사실확인자료 보관
                - 가입자 전기통신일시, 개시, 종료시간, 상대방 신청자번호, 사용도수, 발신기지국 위치추적자료 : 1년
                - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월
                
                제3조(개인정보의 제3자 제공) ① 회사는 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
                ② 회사는 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
                1. 휴대폰 통신사 및 대리점
                - 개인정보를 제공받는 자 : 휴대폰 통신사 및 대리점
                - 개인정보 이용목적 : 회원이 신청 시 기재한 성명 및 전화번호가 통신사에 등록된 성명 및 전화번호와 일치하는지 여부를 판단하기 위함
                - 제공하는 개인정보 항목 : 성명, 전화번호
                - 제공받는 자의 보유이용기간 : 1달
                
                2. 서비스를 이용하는 다른 회원
                - 개인정보를 제공받는 자 : 서비스를 이용하는 다른 회원
                - 개인정보 이용목적 : 서비스를 이용하는 다른 이성회원에게 성명, 사진, 주소, 전화번호 등의 정보를 제공하여 소개팅을 성사시키기 위함
                - 제공하는 개인정보 항목 : 성명, 사진, 주소, 전화번호, 직업, 취미
                - 제공받는 자의 보유 이용기간 : 신청 이력 삭제 시까지
                
                제4조(정보주체의 권리의무 및 행사방법) ① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
                1. 개인정보 열람요구
                2. 오류 등이 있을 경우 정정 요구
                3. 삭제요구
                4. 처리정지 요구
                ② 제1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.
                ③ 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
                ④ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
                ⑤ 정보주체는 개인정보 보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니 됩니다.
                
                제5조(처리하는 개인정보 항목) 회사는 다음의 개인정보 항목을 처리하고 있습니다.
                1. 서비스 회원 신청 및 관리
                필수항목 : 성명, 전화번호, 성별, 주소, 직업, 사진, 취미
                
                
                2. 재화 또는 서비스 제공
                필수항목 : 성명, 전화번호, 성별, 직업, 신용카드번호, 은행계좌정보 등 결제정보
                선택항목 : 관심분야, 과거 구매내역
                
                3. 애플리케이션 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.
                IP주소, 쿠키, MAC주소, 서비스 이용기록, 방문기록, 불량 이용기록 등
                
                제6조(개인정보의 파기) ① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 해당 개인정보를 파기합니다.
                ① 회원 신청 후 징계를 받기 전에 매니저들에게 광고글을 전송하고 신청 이력 삭제 후 재신청을 반복하는 등의 부정이용 행위를 방지하기 위해 신청인증에 사용된 휴대전화번호를 신청 이력 삭제 후 비식별 처리(해시처리)하여 6개월간 보관 후 파기합니다. 휴대전화번호를 복호화가 불가능한 암호화 처리하여 보관하기 때문에 회사도 원본의 휴대전화번호를 확인할 수 없으나, 신청과 신청 이력 삭제를 반복하는 이용자의 휴대전화번호를 동일하게 해시하여 비교하는 작업을 통해 반복 신청, 신청 이력 삭제자인지 여부를 확인하는 목적으로만 활용합니다.
                ② 정보주체로부터 동의 받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관 장소를 달리하여 보존합니다.
                ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
                1. 파기절차
                회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
                2. 파기방법
                회사는 전자적 파일 형태로 기록,저장된 개인정보는 기록을 재생할 수 없도록 로우레밸포멧(Low Level Format) 등의 방법을 이용하여 파기하며, 종이 문서에 기록 저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
                
                제7조(개인정보의 안전성 확보조치) 회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
                1. 관리적 조치 : 내부관리계획 수립 시행, 정기적 직원 교육 등
                2. 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
                3. 물리적 조치 : 전산실, 자료보관실 등의 접근통제
                
                제8조(개인정보 자동 수집 장치의 설치 운영 및 거부에 관한 사항) 회사는 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.`
            };
            setTerms(newTerms);
        }
        //랜딩 사소한 1% - 개인정보 수집 및 이용동의
        else if(popup.termsPopIdx === 7){
            const newTerms = {
                subject: '개인정보 수집 및 이용동의',
                contents_p: `사소한 개인정보 처리방침

                사소한(이하 ‘회사’라 합니다)은 개인정보 보호법 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립,공개합니다.
                
                제1조(개인정보의 처리목적) 회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
                
                1. 홈페이지 회원 신청 및 관리
                회원 신청의사 확인, 회원제 서비스 제공에 따른 본인 식별,인증, 회원자격 유지,관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인, 각종 고지,통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
                2. 재화 또는 서비스 제공
                서비스 제공, 계약서,청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 연령인증, 요금결제,정산, 채권추심 등을 목적으로 개인정보를 처리합니다.
                3. 고충처리
                민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락,통지, 처리결과 통보 등의 목적으로 개인정보를 처리합니다.
                
                제2조(개인정보의 처리 및 보유기간) ① 회사는 법령에 따른 개인정보 보유,이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.
                
                ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
                
                1. 애플리케이션 회원 신청 및 관리 : ‘사소한’ 신청 이력 삭제시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지
                1) 관계 법령 위반에 따른 수사,조사 등이 진행 중인 경우에는 해당 수사,조사 종료 시까지
                2) 홈페이지 이용에 따른 채권,채무관계 잔존 시에는 해당 채권,채무관계 정산 시까지
                
                2. 재화 또는 서비스 제공 : 재화,서비스 공급완료 및 요금결제,정산 완료시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료 시까지
                1) 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시,광고, 계약내용 및 이행 등 거래에 관한 기록
                - 표시,광고에 관한 기록 : 6월
                - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년
                - 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
                2)「통신비밀보호법시행령」에 따른 통신사실확인자료 보관
                - 신청자 전기통신일시, 개시,종료시간, 상대방신청자번호, 사용도수, 발신기지국 위치추적자료 : 1년
                - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월
                
                제3조(개인정보의 제3자 제공) ① 회사는 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
                ② 회사는 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
                1. 휴대폰 통신사 및 대리점
                - 개인정보를 제공받는 자 : 휴대폰 통신사 및 대리점
                - 개인정보 이용목적 : 회원이 신청 시 기재한 성명 및 전화번호가 통신사에 등록된 성명 및 전화번호와 일치하는지 여부를 판단하기 위함
                - 제공하는 개인정보 항목 : 성명, 전화번호
                - 제공받는 자의 보유,이용기간 : 1달
                
                2. 애플리케이션을 이용하는 다른 회원
                - 개인정보를 제공받는 자 : 애플리케이션을 이용하는 다른 회원
                - 개인정보 이용목적 : 애플리케이션을 이용하는 다른 이성회원에게 성명, 사진, 주소, 전화번호 등의 정보를 제공하여 소개팅을 성사시키기 위함
                - 제공하는 개인정보 항목 : 성명, 사진, 주소, 전화번호, 직업, 취미
                - 제공받는 자의 보유,이용기간 : 회원 신청 이력 삭제 시까지
                
                제4조(정보주체의 권리,의무 및 행사방법) ① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
                1. 개인정보 열람요구
                2. 오류 등이 있을 경우 정정 요구
                3. 삭제요구
                4. 처리정지 요구
                ② 제1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.
                ③ 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
                ④ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
                ⑤ 정보주체는 개인정보 보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니 됩니다.
                
                제5조(처리하는 개인정보 항목) 회사는 다음의 개인정보 항목을 처리하고 있습니다.
                1. 애플리케이션 회원 가입 및 관리
                ,필수항목 : 성명, 전화번호, 성별, 주소, 직업, 사진, 취미
                
                
                2. 재화 또는 서비스 제공
                ,필수항목 : 성명, 전화번호, 성별, 직업, 신용카드번호, 은행계좌정보 등 결제정보
                ,선택항목 : 관심분야, 과거 구매내역
                
                3. 애플리케이션 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.
                IP주소, 쿠키, MAC주소, 서비스 이용기록, 방문기록, 불량 이용기록 등
                
                제6조(개인정보의 파기) ① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 해당 개인정보를 파기합니다.
                ② 정보주체로부터 동의 받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관 장소를 달리하여 보존합니다.
                ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
                1. 파기절차
                회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
                2. 파기방법
                회사는 전자적 파일 형태로 기록,저장된 개인정보는 기록을 재생할 수 없도록 로우레밸포멧(Low Level Format) 등의 방법을 이용하여 파기하며, 종이 문서에 기록,저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
                
                제7조(개인정보의 안전성 확보조치) 회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
                1. 관리적 조치 : 내부관리계획 수립,시행, 정기적 직원 교육 등
                2. 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
                3. 물리적 조치 : 전산실, 자료보관실 등의 접근통제
                
                제8조(개인정보 자동 수집 장치의 설치,운영 및 거부에 관한 사항) 회사는 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.`
            };
            setTerms(newTerms);
        }
        //랜딩 사소한 1% - 이용약관 동의
        else if(popup.termsPopIdx === 8){
            const newTerms = {
                subject: '이용약관 동의',
                contents_p: `제 1 조 (목적)

                본 약관은 사소한(이하 "회사")가 제공하는 사소한 웹사이트에서 제공하는 인터넷 관련 서비스(이하 "서비스"라 한다)를 이용함에 있어 사이버쇼핑몰과 이용자의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.
                
                제 2 조 (용어의 정의)
                
                ① "운영자"라 함은 "서비스"의 전반적인 관리와 원활한 운영을 위하여 "회사"가 선정한 사람을 의미합니다.
                
                ② 이용자라 함은 "사소한 에 접속하여 이 약관에 따라 "사소한 및 사소한 클럽"이 제공하는 서비스를 받는 기업회원 및 개인회원, 비회원을 말합니다.
                
                ③"회원"이라 함은 "회사"에서 제공하는 사이트에 접속하여 홈페이지 이용약관과 개인정보취급방침에 동의하고, 아이디와 비밀번호를 발급 받은 고객으로 "회원"의 자격 및 권한은 회원유형별로 관리합니다. "사소한"의 정보를 지속적으로 제공받으며, "사소한 클럽 및 사소한 코리가"가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
                
                4. "아이디(ID)"라 함은 "회원" 식별과 "회원"의 서비스 이용을 위하여 "회원"이 선정하고 "회사"가 승인하는 영문자와 숫자의 조합으로, 하나의 주민등록번호에 하나의 ID만 발급, 이용 가능합니다.
                
                5. "비밀번호"라 함은 "회원"의 비밀 보호를 위해 "회원" 자신이 설정한 문자와 숫자의 조합을 의미합니다.
                
                6. "불법스팸"이라 함은 서비스를 이용해 수신자가 원하지 않는데도 불구하고 일방적으로 전송 또는 게시되는 영리목적의 광고성 정보
                
                7. "게시물"이란 회원이 올린 영상, 글, 사진, 그림, 각종 파일과 링크, 각종 답글 등의 정보의 총칭을 말합니다.
                
                
                제 3 조 (약관의 명시와 개정)
                
                
                ① 회사는 본 약관의 내용과 회사의 상호, 영업소 소재지, 대표자 성명, 사업자 등록번호, 연락처(전화, 팩스 등)등을 회원이 알 수 있도록 서비스 초기 화면에 게시합니다.
                
                ② 회사는 본 약관을 규제에 관한 법률, 전자거래기본법, 전자서명법, 정보통신망이용촉진 등에 관한 법률, 방문판매 등에 관한 법률, 소비자보호법 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
                
                ③ 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 쇼핑몰의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다.
                
                ④ 본 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지 기간 내에 "사소한"에 송신하면 개정약관 조항이 적용됩니다.
                
                5. 회원은 개정된 약관에 대해 동의하지 않을 권리가 있으며, 개정된 약관에 동의하지 않을 경우이용계약을 해지할 수 있습니다. 회원이 회사의 전항 단서에 따른 약관의 불리한 변경에 대하여 적용예정일까지 회사에게 부동의 의사를 표시하지 않거나 이용계약을 해지하지 않은 경우 변경된 약관을 승인한 것으로 봅니다.
                
                ① 회사는 개별 서비스에 대해서는 별도의 이용약관 및 규정, 세부 이용지침 등을 둘 수 있으며, 해당 내용이 본 약관과 상충할 경우에는 개별서비스 약관이 우선하여 적용됩니다.
                
                ② 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 전자거래소비자보호지침 및 관계법령 또는 일반 상관례에 따릅니다.
                
                
                제 4 조 (서비스의 제공 및 변경)
                
                
                ① 사소한는 다음과 같은 업무를 수행합니다.
                
                가.회원과 회원간의 매칭 업무
                
                
                제 5 조 (서비스의 중단)
                
                
                
                ① 사소한는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
                
                ② 제1항에 의한 서비스 중단의 경우에는 "사소한"는 제8조에 정한 방법으로 이용자에게 통지합니다.
                
                ③ 사소한은 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단 "사소한"에 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.
                
                
                
                
                제 6 조 (이용신청에 대한 승낙의 제한)
                
                ① 회사는 다음의 각 호에 해당하는 신청에 대하여는 승낙을 제한할 수 있으며, 이 사유가 해소될 때까지 승낙을 유보하거나 승낙한 이후에도 이용계약을 해지할 수 있습니다.
                
                1. 기술상 서비스 제공이 불가능하거나 서비스 관련 설비 용량이 부족한 경우
                
                2. 실명이 아니거나, 다른 사람의 명의사용 등 이용자 등록 시 허위로 신청하는 경우
                
                3. 이용자 등록 사항을 누락하거나 오기하여 신청하는 경우
                
                4. 사회의 안녕질서 또는 미풍양속을 저해하거나, 저해할 목적으로 신청한 경우
                
                5. 서비스 이용목적 또는 이용행위가 법령에 위반되거나 제3자의 권리를 침해할 우려가 있는 경우
                
                6. 악성 프로그램 및 버그를 이용하거나 시스템 취약점을 악용하는 등 부정한 방법을 서비스에 사용한 경우
                
                7. 이전에 회원 자격을 상실한 적이 있는 경우. 다만, 동 자격 상실 이후 1년 이상 경과한 자로 회사의 회원 재신청 승낙을 받은 경우는 예외로 합니다.
                
                8. 기타 회사가 정한 이용신청 요건이 만족되지 않았을 경우
                
                ② 회원은 그 자격에 따라 서비스 이용의 일부가 제한될 수 있습니다.
                
                
                제 7 조 (회원정보의 변경)
                
                ① 회원은 이용 신청 시 기재한 사항이 변경되었을 경우, 즉시 전자우편 또는 회사가 정한 별도의 정해진 양식 및 이용방법으로 변경사항을 알리고 수정하거나 기타 방법으로 회사에 대하여 그 변경사항을 알려야 합니다.
                
                ② 회사는 회원이 변경사항을 알리지 아니하여 발생한 손해에 대하여 책임지지 않습니다.
                
                ③ 회원은 회원정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위하여 실명, 주민등록번호, ID 등은 수정이 불가능합니다.
                
                
                제 3 장 서비스 이용에 관한 일반사항
                
                본 장에서는 사소한 웹사이트를 통한 서비스의 제공 또는 이용에 관한 일반적인 사항을 규정합니다.
                
                
                제 10 조 (서비스의 이용개시)
                
                ① 회사는 회원의 이용신청을 승낙한 때부터 서비스를 개시합니다. 단, 일부 서비스의 경우에는 지정된 일자부터 서비스를 개시합니다.
                
                ② 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 홈페이지에 공시하거나 회원에게 이를 통지합니다.
                
                ③ 회사는 특정한 서비스를 제공하기 위해 회원에게 별도 또는 추가적인 신청절차를 요청할 수 있으며, 이러한 특정 서비스를 이용할 경우 해당 사이트 또는 서비스에 대한 이용약관, 규정 또는 세칙 등이 본 약관보다 우선 적용됩니다.
                
                
                제 11 조 (서비스의 사용 및 저장)
                
                ① 회사는 서비스의 이용에 관한 일반 관례 및 제한을 둘 수 있으며, 이를 통해 전자메일 메시지, 게시판 게시물, 업로드 영상물 또는 기타 게재된 내용이 서비스에 의해 보유되는 최대 일수 및 용량, 서비스 상의 계정에서 송수신할 수 있는 전자메일 메시지의 최대수, 서비스 상의 계정에서 송수신할 수 있는 전자메일 메시지의 최대 크기, 서버에 할당되는 최대 디스크 공간 및 정해진 기간 동안 서비스에 접속할 수 있는 최대한의 수 (최대 기간)에 대한 정책을 규정할 수 있습니다.
                
                ② 회사의 정책에도 불구하고 회사의 귀책사유 없이 전①항의 정책에 따라 서비스에 보관되거나 전송된 메시지 및 영상, 기타 통신 또는 내용을 삭제하거나 저장하지 못한데 대해 회사는 아무런 책임을 지지 않습니다.
                
                ③ 회사는 제공 되는 서비스의 성격에 따라 제반 법령의 준수 및 정상적인 서비스의 이용을 위하여 필요한 경우 메시지 저장, 위치정보 저장 등 해당 서비스의 내용을 저장 할 수 있습니다.
                
                
                제 12 조 (서비스의 이용시간)
                
                ① 서비스의 이용은 회사의 업무상 또는 기술상의 특별한 지장이 없는 한 평일, 1일 8시간을 원칙으로 합니다.
                
                ② 회사는 서비스를 일정 범위로 분할하여 각 범위별로 이용 가능한 시간을 별도로 정할 수 있으며, 이 경우 그 내용을 사이트에 공지합니다.
                
                
                제 13조 (서비스의 변경 및 중지)
                
                ① 회사는 수시로 서비스의 향상을 위하여 기존 서비스의 전부 또는 일부 내용을 별도의 통지없이 변경할 수 있습니다.
                
                ② 회사는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
                
                1. 컴퓨터 등 정보통신설비의 보수점검 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우
                
                2. 서비스를 위한 설비의 보수 등 공사로 인해 부득이한 경우
                
                3. 서비스 업그레이드 및 사이트 유지보수 등을 위해 필요한 경우
                
                4. 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
                
                5. 영상, 음악 등 각종 컨텐츠 등의 원저작권자 또는 관련 원천권리권자와의 계약 종료 등 서비스 제공을 위한 원천 데이터 확보가 어려운 경우
                
                6. 회원이 회사의 영업활동을 방해하는 경우
                
                7. 서비스 제공업자와의 계약종료 등 회사의 제반 사정으로 서비스를 유지할 수 없는 경우
                
                8. 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
                
                ③ 본 조 제2항에 의한 서비스 중단의 경우에는 회사가 정한 방법으로 이용자에게 통지합니다. 단, 회사가 통제할 수 없는 사유로 인한 서비스의 중단(운영자의 고의적 과실이 없는 디스크 장애, 시스템 장애 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.
                
                ④ 회사는 본 조 제2항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대해 배상하지 않음을 원칙으로 합니다. 단, 회사에 고의 또는 중과실이 있는 경우에는 그러하지 아니합니다.
                
                
                제 14 조 (정보의 제공, 광고의 게재 및 하이퍼링크)
                
                ① 회사는 서비스의 운영과 관련하여 사이트, 서비스화면, SMS, 전자우편 등에 적절하다고 판단되거나 활용 가능성이 있는 광고 등을 게시할 수 있으며, 회원은 소정의 절차를 통해 제한적으로 이를 거부할 수 있습니다.
                
                ② 회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한 광고주의 판촉활동에 참여하는 등의 방법으로 교신 또는 거래를 하는 것은 전적으로 회원과 광고주간의 문제입니다. 만약 회원과 광고주간에 문제가 발생할 경우에도 회원과 광고주가 직접 해결해야 하며, 이와 관련하여 회사는 어떠한 책임도 지지 않습니다.
                
                ③ 회사는 하이퍼링크 등으로 연결된 사이트가 독자적으로 제공하는 재화용역에 의해 이용자와 행하는 거래에 대해서 보증 책임을 지지 않습니다.
                
                ④ 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 정보 제공을 위한 이메일의 수신을 거절할 수 있습니다. 다만, 수신 거절 당시 이미 발송 중인 이메일은 기술상의 이유로 발송이 중단되지 않을 수 있습니다.
                
                ⑤ 회원은 회사가 제공하는 배너 광고에 대한 임의의 삭제, 비방, 기타 배너 광고 방해 행위 등을 할 수 없습니다.
                
                ⑥ 회사는 서비스를 운용함에 있어서 고객 리뷰/평가 정보, 접속자 수를 이용한 랭킹정보 등 각종 정보 DB를 서비스에 게재하는 방법 등으로 회원에게 제공 할 수 있고, 회사의 연계 사업에 활용할 수 있습니다.
                
                ⑦ 본 회사가 운영하는 서비스를 회원이 신청을 한 경우에는 카카오톡, SMS, LMS 등으로 안내를 받을 수 있습니다. 단, 회원이 신청을 취소한 경우에는 제한적으로 이를 거부할 수 있습니다.
                
                
                제 15 조 (게시물 또는 내용물의 삭제)
                
                ① 회사는 회원이 게시하거나 전달하는 서비스 내의 모든 내용물(회원간 전달 포함)이 다음 각 호의 경우에 해당한다고 판단되는 경우 사전통지 없이 삭제할 수 있으며, 이에 대해 회사는 어떠한 책임도 지지 않습니다.
                
                1. 회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 내용인 경우
                
                2. 회사, 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우
                
                3. 음란물을 게재, 공개 하거나 음란사이트를 연결(링크)하는 경우
                
                4. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등의 유포에 해당하는 경우
                
                5. 범죄적 행위에 결부된다고 인정되는 내용인 경우
                
                6. 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
                
                7. 제2항 소정의 세부이용지침을 통하여 회사에서 규정한 게시기간을 초과한 경우
                
                8. 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 내용이거나 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 경우
                
                9. 회사에서 공식적으로 인정한 경우를 제외한 서비스를 이용하여 상품을 판매하는 영업 활동 및 해킹, 광고를 통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법배포를 하는 경우
                
                10. 법률에 의하거나 계약상 또는 위임에 의하여 전송할 수 있는 권리가 없는 내용을 게시, 게재, 전자메일 또는 여하한의 방법으로 전송하거나 공개하는 경우
                
                11. 회사에서 제공하는 서비스와 관련 없는 내용인 경우
                
                12. 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
                
                13. 기타 관계 법령 및 회사의 지침 등에 위반된다고 판단되는 경우
                
                ② 회사는 게시물에 관련된 세부 이용지침을 별도로 정하여 시행할 수 있으며, 회원은 그 지침에 따라 각종 게시물(회원간 전달 포함)을 등록하거나 삭제하여야 합니다.
                
                ③ 서비스 게시물 또는 내용물이 타인의 사생활을 침해, 명예를 훼손하는 등 타인의 권리를 침해하는 경우, 침해를 받은 자는 홈페이지의 신고메뉴, 전화, 이메일 등의 방법으로 침해사실을 소명하여 회사에 침해 중단에 필요한 조치를 요구할 수 있습니다.
                
                ④ 전항의 요구가 있을 경우, 회사는 관련 법규에 따라 반박내용의 게재, 삭제, 임시조치 등의 필요한 조치를 취할 수 있으며 신청인 및 정보게재자에게 이메일 등의 방법으로 조치사항을 통보하며, 해당 게시판에 공지하는 등의 방법으로 이용자가 알 수 있도록 하여야 합니다.
                
                ⑤ 권리의 침해 여부를 판단하기 어렵거나 이해당사자 간에 다툼이 예상되는 경우, 회사는 해당 정보에 대한 접근을 임시적으로 차단하는 조치(이하 "임시조치"라 한다)를 취할 수 있으며, 임시조치의 기간은 30일 이내로 합니다.
                
                
                제 16 조 (게시물의 저작권)
                
                ① 회사가 작성하여 사이트 또는 서비스에 게시한 저작물의 저작권은 회사에 귀속됩니다. 단, 회원이 게시한 저작물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
                
                ② 회원이 서비스 내에 게시한 게시물(회원간 전달 포함)의 권리와 책임은 회원에게 있으며, 회사는 서비스 내에 이를 게시할 수 있는 권리를 갖습니다. 아울러 회사는 당해 게시물을 게시한 회원의 동의 없이 게시물을 다른 목적으로 사용할 수 없습니다.
                
                ③ 회원은 개별약관 및 관련법령의 규정에서 별도로 정하지 않는 한 서비스에 공개적으로 게재하거나 제출한 자료에 대해 게재 및 제출과 동시에 자동적으로 해당 자료에 대하여 회사에게 사용료 없는, 영구적이고, 취소 불가능하며, 비독점적이고 재라이센스 할 수 있는 사용권한을 부여 하는 것으로 간주 합니다.
                
                ④ 회사는 회원이 서비스 내에 게시한 게시물이 타인의 저작권, 프로그램 저작권 등을 침해하더라도 이에 대한 민·형사상의 책임을 부담하지 않습니다. 만일 회원이 타인의 저작권, 프로그램저작권 등을 침해하였음을 이유로 회사가 타인으로부터 손해배상청구 등 이의 제기를 받은 경우 회원은 회사의 면책을 위하여 노력하여야 하며, 회사가 면책되지 못한 경우 회원은 그로 인해 회사에 발생한 모든 손해를 부담하여야 합니다.
                
                ⑤ 회사는 회원이 해지하거나 적법한 사유로 해지 된 경우 해당 회원이 게시하였던 게시물을 삭제할 수 있습니다.
                
                ⑥ 회원은 서비스에 게시된 자료 또는 서비스를 이용하여 얻은 정보를 회사의 사전승낙 없이 복제,송신,출판,배포,방송 및 기타 방법에 의해 영리목적으로 이용하거나 제3자에게 이용하게 할 수 없으며, 게시물에 대한 지적재산권 침해는 관계법령의 적용을 받습니다.
                
                ⑦ 본 서비스 또는 서비스와 관련 된 소프트웨어와 관련 지적재산권 및 기타 법률에 의해 보호되며, 후원 광고에 포함되어 있는 내용이나 본 서비스 또는 광고주를 통하여 회원에게 제공 되는 정보는 저작권, 상표권, 특허 등 제반 지적재산권 관련 법규에 의해 보호됩니다.
                
                
                제 17 조 (서비스의 재판매 금지)
                
                회원은 상업적인 목적을 위하여 본 서비스 자체, 서비스 이용 또는 서비스 내용의 일부 또는 전부를 복사, 복제, 판매, 재판매 또는 이용할 수 없습니다.
                
                
                제18 조 (상품의 구매 절차)
                
                ① 상품의 구매절차 시 구매자와 판매자에 대한 용어의 정의는 다음 각 호와 같습니다.
                
                1. 구매자: 회원 매칭서비스를 이용할 의사로 주문을 낸 자를 말합니다.
                
                2. 판매자: 사소한을 말합니다.
                
                ② 상품의 구매는 다음 각 호의 절차와 방법으로 이루어 집니다
                
                1. 결과처리
                
                구매자는 구매하기를 통해 구매 완료가 되면 회사로부터 구매 완료 내용을 e-mail이나 카카오톡 으로 연락을 받습니다.
                
                2. 대금결제
                
                가. 이용자가 상품을 구입할 때 사용할 수 있는 결제 수단은 신용카드와 실시간 계좌이체 등이 있습니다.
                
                나. 회사의 고의 또는 과실로 이용자의 결제정보가 유출되어 해당 이용자가 피해를 입었을 경우 회사는 정보유출에 대한 모든 책임을 집니다.
                
                다. 일정액 이상의 상품을 카드결제로 구매할 경우 본인 확인을 위해 주민등록번호와 비밀번호 등의 개인정보를 입력하여야 합니다.
                
                
                제 20 조 (회사의 의무)
                
                ① 회사는 서비스 제공과 관련하여 알고 있는 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 단, 관계법령에 의한 수사상의 목적으로 관계기관으로부터 요구 받은 경우나 방송통신심의위원회의 요청이 있는 경우 등 법률의 규정에 따른 적법한 절차에 의한 경우에는 그러하지 않습니다.
                
                ② 제1항의 범위 내에서, 회사는 업무와 관련하여 회원의 사전 동의 없이 회원 전체 또는 일부의 개인정보에 관한 통계자료를 작성하여 이를 사용할 수 있고, 이를 위하여 회원의 컴퓨터에 쿠키를 전송할 수 있습니다. 이 경우 회원은 쿠키의 수신을 거부하거나 쿠키의 수신에 대하여 경고하도록 사용하는 컴퓨터의 브라우저의 설정을 변경할 수 있으며, 쿠키의 설정 변경에 의해 서비스 이용이 변경되는 것은 회원의 책임입니다.
                
                ③ 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 신속하게 처리하여야 하며, 신속한 처리가 곤란한 경우 그 사유와 처리 일정을 홈페이지 화면에 게재하거나 e-mail 등을 통하여 동 회원에게 통지합니다.
                
                ④ 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한 손해가 회사의 고의나 중과실에 기해 발생한 경우에 한하여 회사에서 책임을 부담하며, 그 책임의 범위는 통상손해에 한합니다.
                
                ⑤ 회사는 정보통신망 이용촉진 및 정보보호에 관한 법률, 통신비밀보호법, 전기통신사업법 등 서비스의 운영, 유지와 관련 있는 법규를 준수합니다.
                
                
                제 21 조 (회원의 의무)
                
                ① 회원은 서비스를 이용할 때 다음 각 호의 행위를 하여서는 아니 됩니다.
                
                1. 이용 신청 또는 변경 시 허위 사실을 기재하거나, 다른 회원의 ID 및 비밀번호를 도용, 부정하게 사용하는 행위
                
                2. 회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 행위
                
                3. 타인의 명예를 손상시키거나 불이익을 주는 행위
                
                4. 게시판 등에 음란물을 게재하거나 음란사이트를 연결(링크)하는 행위
                
                5. 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위
                
                6. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형, 음성 등을 타인에게 유포하는 행위
                
                7. 서비스와 관련된 설비의 오 동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 행위 - 서비스 운영을 고의로 방해하거나 서비스의 안정적 운영을 방해할 수 있는 정보 및 수신자의 명시적인 수신거부의사에 반하여 광고성 정보를 전송하는 행위
                
                8. 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
                
                9. 다른 회원의 개인정보를 수집, 저장, 공개하는 행위
                
                10. 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위
                
                11. 재물을 걸고 도박하거나 사행행위를 하는 행위
                
                12. 윤락행위를 알선하거나 음행을 매개하는 내용의 정보를 유통시키는 행위
                
                13. 수치심이나 혐오감 또는 공포심을 일으키는 말이나 음향, 글이나 화상 또는 영상을 계속하여 상대방에게 도달하게 하여 상대방의 일상적 생활을 방해하는 행위 - 서비스에 게시된 정보를 변경하는 행위
                
                14. 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 포함)의 전송 또는 게시 행위
                
                15. 회사의 직원이나 운영자를 가장하거나 사칭하여 또는 타인의 명의를 도용하여 글을 게시하거나 메일을 발송하는 행위
                
                16. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 e-mail으로 발송하는 행위
                
                17. 스토킹(stalking) 등 다른 회원을 괴롭히는 행위
                
                18. 사이트를 이용하여 구입한 재화 용역 등의 대금, 기타 사이트 이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 행위
                
                19. 다른 사람의 사이트 이용을 방해하거나 그 정보를 도용하는 등 전자거래 질서를 위협하는 행위
                
                20. 기타 불법적이거나 부당한 행위
                
                ② 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니됩니다.
                
                ③ 회원은 회사에서 공식적으로 인정한 경우를 제외하고는 서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없으며 특히 해킹, 광고를 통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법배포 등을 할 수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등에 관해서는 회사가 책임을 지지 않으며, 회원은 이와 같은 행위와 관련하여 회사에 대하여 손해배상 의무를 집니다.
                
                ④ 회원은 시스템 장애로 인한 훼손에 대비하여 웹페이지 게재 자료, 이메일 등 중요한 자료의 복제본을 마련하여야 하며, 이를 해태하여 발생한 손해에 대하여 회사는 책임지지 않습니다.
                
                ⑤ 회원은 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 규정된 광고성 정보 전송 시 의무사항을 준수하여야 합니다.
                
                ⑥ 회원은 불법스팸을 전송함으로써 발생하는 모든 민·형사상 책임을 부담합니다.
                
                
                
                제 22 조 (아이디와 비밀번호관리에 대한 의무와 책임)
                
                ① 회사는 사이트 내에서 일부 서비스 신청 시 이용요금을 부과할 수 있으므로, 회원은 회원 아이디 및 비밀번호 관리를 철저히 하여야 합니다.
                
                ② 회원 아이디와 비밀번호의 관리 소홀, 부정 사용에 의하여 발생하는 모든 결과에 대한 책임은 회원 본인에게 있으며, 회사의 시스템 고장 등 회사의 책임 있는 사유로 발생하는 문제에 대해서는 회사가 책임을 집니다.
                
                ③ 회원은 본인의 아이디 및 비밀번호를 제3자에게 이용하게 해서는 안되며, 회원 본인의 아이디 및 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 인지하는 경우에는 바로 회사에 통보하고 회사의 안내가 있는 경우 그에 따라야 합니다. 해당 회원이 회사에 그 사실을 통보하지 않거나, 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
                
                
                제 23 조 (회원에 대한 통지)
                
                ① 회사는 회원이 회사에 제출한 e-mail주소 또는 SMS 등 기타 통신수단을 이용하여 회원에 대한 통지를 할 수 있습니다. 회원이 e-mail주소 또는 전화번호 등의 정보를 잘못 제출하여 통지가 이루어지지 않는 경우 회사는 회원이 제출한 정보로 발송한 때에 회원에게 도달한 것으로 봅니다.
                
                ② 회사는 불특정다수 회원에 대한 통지의 경우 서비스 게시판 등에 게시함으로써 개별 통지를 갈음할 수 있습니다.
                
                
                
                제 24 조 (개인정보의 보호)
                
                ① 회사는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관해서는 관련 법령 및 회사의 개인정보보호정책이 적용됩니다. 단, 회사의 공식 사이트 이외의 웹에서 링크된 사이트에서는 회사의 개인정보 보호정책이 적용되지 않습니다. 또한 회사는 회원의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.
                
                ② 회사는 약관 또는 관계 법령이 정한 경우 이외에는 회원의 개인정보를 본인의 동의없이 제3자에게 제공하지 아니합니다.
                
                ③ 회사가 이용자의 개인식별이 가능한 개인정보를 수집하는 때에는 반드시 당해 이용자의 동의를 받습니다.
                
                ④ 회사는 전 ③ 항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보관리책임자의 성명 또는 개인정보보호 업무 및 관련 고충사항을 처리하는 부서의 명칭과 그 전화번호 등 연락처, 정보 수집의 목적 및 이용목적, 제 3자에 대한 정보제공 관련사항 (개인정보를 제공받는 자, 개인정보를 제공받는 자의 개인정보 이용 목적, 제공하는 개인정보의 항목, 개인정보를 제공받는 자의 개인정보 보유 및 이용 기간)등 정보통신망 이용촉진 및 정보보호 등에 관한 법률의 내용과, 제31조 (상픔의 구매절차) 내지 제44조 (관할법원)의 내용을 미리 명시하거나 고지 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
                
                ⑤ 이용자는 언제든지 서비스의 "회원정보 변경"을 통해 자신의 개인정보를 열람 및 오류정정을 하실 수 있습니다. 또한 회사에 언제든지 자신의 회원정보를 변경해 줄 것을 요청할 수 있으며, 이에 대해 회사는 지체 없이 조치할 의무를 집니다.
                
                ⑥ 회사는 개인정보 보호를 위하여 개인정보 관리자를 지정하며, 신용카드, 은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.
                
                ⑦ 회사 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다. 단 다음은 예외로 합니다.
                
                
                1. 상법 등의 다른 법령의 규정에 의하여 보존할 필요성이 있는 경우
                
                2. 소송이나 분쟁에 있어 근거자료로 보존할 필요성이 있는 경우
                
                3. 기타 개별적으로 이용자의 동의를 받은 경우
                
                그러나 이 경우에도 정당한 근거와 함께 사전에 개인정보가 보유되는 기간을 정확하게 고지하고, 이후 완전 파기합니다.
                
                ⑧ 회사는 회원 개인정보보호를 위해 관련법령 및 회사가 정하는 "개인정보취급방침"의 규정에 의거하여 개인정보보호를 위해 노력하고 있으며, "개인정보취급방침"은 본 약관과 동일한 효력을 가집니다.
                
                
                제 25 조 (개인정보의 위탁)
                
                회사는 수집된 개인정보의 취급 및 관리 등의 업무(이하 "업무")를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를 회사가 선정한 회사에 위탁할 수 있습니다.
                
                
                제 26 조 (양도금지)
                
                회원은 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도, 증여할 수 없으며 게시물에 대한 저작권을 포함한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.
                
                
                제 27 조 (자료의 보존)
                
                ① 회사는 회원의 거래내역을 거래완료 후 3년간 보존합니다. 단, 국세기본법 등 관계법령에 의한 경우에는 3년 이후에도 회사의 시스템 등 사정에 따라 보존할 수 있습니다.
                
                ② 회사 내의 데이터베이스에 보존된 자료와 청구기관 측의 데이터베이스에 보존된 자료의 기재내용이 상이하여 회사가 회원에 대하여 자료 기재 내용의 확인을 요구할 경우에는 회원은 이에 응해야 합니다.
                
                
                제 28 조 (소개 신청 이력 삭제 및 휴면)
                
                1. 회원이 신청 이력을 삭제 하고자 할 경우, 사소한 신청 이력에 대해 삭제 요청을 하여야 합니다.
                
                2. 회원이 신청 이력을 삭제할 경우, 관련법 및 개인정보취급방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 60일까지는 암호화 처리되어 보관되며, 60일 이후 회원의 모든 데이터는 소멸됩니다.
                
                3. 회원이 신청 이력을 삭제할 경우, 타인에 의해 스크랩 등 되어 재게시되거나, 공용게시판에 등록된 게시물 등은 삭제되지 않으니 사전에 삭제 후 신청 이력을 삭제하시기 바랍니다.
                
                4. 회사는 회원이 제21조에 규정한 회원의 의무를 이행하지 않을 경우 사전 통지 없이 이용계약을 해지하거나 또는 서비스 이용을 중지할 수 있습니다.
                
                5. 회사는 회원이 이용계약을 체결하여 ID와 비밀번호를 부여 받은 후에라도 회원의 자격에 따른 서비스 이용을 제한할 수 있습니다.
                
                6. 회사는 신청 후 6개월 동안 서비스 사용이력이 없는 회원에 대해 사용의사를 묻는 고지를 하고 회사가 정한 기한 내에 답변이 없는 경우 이용계약을 해지할 수 있습니다 이때 아이디를 포함한 개인정보 및 메일, 블로그 등 모든 서비스 이용정보는 삭제됩니다.
                
                7. 회사는 고객의 ID, 비밀번호의 도용을 방지하기 위하여, 회사의 웹사이트에 연속하여 1년 이상 접속한 이력이 없을 경우&#39;휴면ID&#39;로 정하며, 다음 항목과 같이 로그인을 제한할 수 있습니다.
                
                - 고객 본인 확인 절차를 수행한 후 비밀번호를 신규 등록
                
                
                제 29 조 (회원자격 제한 및 자격상실)
                
                ① 회원이 다음 각 호의 사유에 해당하거나 본 약관상의 의무를 이행하지 않은 경우, 회사는 회원자격을 제한 또는 정지시킬 수 있으며, 회원은 회사에게 이용정지에 따른 보상을 청구할 수 없습니다.
                
                1. 이용신청 시에 허위 내용을 등록한 경우
                
                2. 다른 사람의 사이트 이용을 방해하거나 그 정보를 도용하는 등 전자거래질서를 위협하는 경우
                
                3. 전기통신기본법, 전기통신사업법, 정보통신윤리위원회심의규정, 정보통신윤리강령, 프로그램보호법 및 기타 관련 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
                
                4. 방송통신위원회 또는 한국정보보호진흥원이 불법스팸 전송사실을 확인하여 이용정지를 요청하는 경우
                
                5. 대량으로 메일이나 SMS 등을 전송하여 시스템 장애를 야기했거나 야기할 우려가 있는 경우
                
                6. 불법스팸 릴레이로 이용되거나 웜에 감염된 메일이나 SMS 등을 전송한 경우
                
                7. 해당 광고를 수신한 자가 수신거부를 요청하였으나 계속 재전송한 경우
                
                ② 회사는 회원에게 전항의 회원자격의 제한정지 사실을 이메일, 웹페이지 게시 등의 방법으로 즉시 통보합니다.
                
                ③ 회사가 회원의 자격을 제한·정지시킨 후 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우에 회사는 해당 회원의 자격을 상실 시킬 수 있습니다.
                
                ④ 회원은 본 조의 회사 조치에 대하여 회사가 정한 절차에 따라 이의신청을 할 수 있으며, 회원의 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다
                
                
                제 30 조 (손해배상)
                
                ① 회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이 약관을 위반한 회원은 회사에 발생하는 모든 손해를 배상하여야 합니다.
                
                ② 회원이 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 회사를 면책 시켜야 하며, 회사가 면책되지 못한 경우 당해 회원은 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다.
                
                
                
                제 31 조 (면책조항)
                
                ① 회사는 국가의 비상사태, 천재지변 또는 이에 준하는 불가항력으로 인해 서비스를 제공할 수 없는 경우에는 서비스 제공에 대한 책임을 지지 않습니다.
                
                ② 회사는 회원의 귀책사유로 인한 서비스의 이용장애에 대해 책임을 지지 않습니다.
                
                ③ 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대한 책임을 지지 않으며, 그밖에 서비스를 통해 얻은 자료로 인한 손해 등에 대하여도 책임을 지지 않습니다.
                
                ④ 회사는 회원이 사이트에 게재한 게시물의 신뢰도 및 정확성 등 내용에 대해 책임을 지지 않으며, 서비스에 게재된 어떠한 의견이나 정보에 대해 확인이나 대표할 의무가 없습니다. 아울러 회사는 회원이나 제3자에 의해 표출된 의견을 승인, 반대 또는 수정하지 않습니다.
                
                ⑤ 회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며 이로 인한 손해를 배상할 책임을 지지 않습니다.
                
                
                제 32 조 (관할법원)
                
                ① 서비스 이용과 관련하여 회사와 회원 사이에 분쟁이 발생한 경우, 회사와 회원은 분쟁의 해결을 위해 성실히 협의합니다.
                
                ② 본 조 제1항의 협의에서도 분쟁이 해결되지 않을 경우 양 당사자는 민사소송법상의 관할법원에 소를 제기할 수 있습니다.
                
                ③ 회사와 이용자간에 제기된 소송에는 대한민국 법을 적용합니다.
                
                
                
                부 칙
                
                1. (시행일) 이 약관은 2011년 01월 03일부터 시행합니다.`
            };
            setTerms(newTerms);
        }
        //랜딩 소개팅신청 - 개인정보 수집 및 이용동의
        else if(popup.termsPopIdx === 9){
            const newTerms = {
                subject: '이용약관 동의',
                contents_p: `사소한 개인정보 처리방침

                사소한(이하 ‘회사’라 합니다)은 개인정보 보호법 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립,공개합니다.
                
                제1조(개인정보의 처리목적) 회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
                
                1. 홈페이지 회원 신청 및 관리
                회원 신청의사 확인, 회원제 서비스 제공에 따른 본인 식별,인증, 회원자격 유지,관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인, 각종 고지,통지, 고충처리 등을 목적으로 개인정보를 처리합니다.
                2. 재화 또는 서비스 제공
                서비스 제공, 계약서,청구서 발송, 콘텐츠 제공, 맞춤서비스 제공, 본인인증, 연령인증, 요금결제,정산, 채권추심 등을 목적으로 개인정보를 처리합니다.
                3. 고충처리
                민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락,통지, 처리결과 통보 등의 목적으로 개인정보를 처리합니다.
                
                제2조(개인정보의 처리 및 보유기간) ① 회사는 법령에 따른 개인정보 보유,이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.
                
                ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
                
                1. 애플리케이션 회원 가입 및 관리 : ‘사소한’ 탈퇴시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지
                1) 관계 법령 위반에 따른 수사,조사 등이 진행 중인 경우에는 해당 수사,조사 종료 시까지
                2) 홈페이지 이용에 따른 채권,채무관계 잔존 시에는 해당 채권,채무관계 정산 시까지
                
                2. 재화 또는 서비스 제공 : 재화,서비스 공급완료 및 요금결제,정산 완료시까지
                다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료 시까지
                1) 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시,광고, 계약내용 및 이행 등 거래에 관한 기록
                - 표시,광고에 관한 기록 : 6월
                - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년
                - 소비자 불만 또는 분쟁처리에 관한 기록 : 3년
                2)「통신비밀보호법시행령」에 따른 통신사실확인자료 보관
                - 신청자 전기통신일시, 개시,종료시간, 상대방 신청자번호, 사용도수, 발신기지국 위치추적자료 : 1년
                - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월
                
                제3조(개인정보의 제3자 제공) ① 회사는 정보주체의 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
                ② 회사는 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
                1. 휴대폰 통신사 및 대리점
                - 개인정보를 제공받는 자 : 휴대폰 통신사 및 대리점
                - 개인정보 이용목적 : 회원이 신청 시 기재한 성명 및 전화번호가 통신사에 등록된 성명 및 전화번호와 일치하는지 여부를 판단하기 위함
                - 제공하는 개인정보 항목 : 성명, 전화번호
                - 제공받는 자의 보유,이용기간 : 1달
                
                2. 애플리케이션을 이용하는 다른 회원
                - 개인정보를 제공받는 자 : 애플리케이션을 이용하는 다른 회원
                - 개인정보 이용목적 : 애플리케이션을 이용하는 다른 이성회원에게 성명, 사진, 주소, 전화번호 등의 정보를 제공하여 소개팅을 성사시키기 위함
                - 제공하는 개인정보 항목 : 성명, 사진, 주소, 전화번호, 직업, 취미
                - 제공받는 자의 보유,이용기간 : 회원 탈퇴 시까지
                
                제4조(정보주체의 권리,의무 및 행사방법) ① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
                1. 개인정보 열람요구
                2. 오류 등이 있을 경우 정정 요구
                3. 삭제요구
                4. 처리정지 요구
                ② 제1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.
                ③ 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.
                ④ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
                ⑤ 정보주체는 개인정보 보호법 등 관계법령을 위반하여 회사가 처리하고 있는 정보주체 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니 됩니다.
                
                제5조(처리하는 개인정보 항목) 회사는 다음의 개인정보 항목을 처리하고 있습니다.
                1. 애플리케이션 회원 가입 및 관리
                ,필수항목 : 성명, 전화번호, 성별, 주소, 직업, 사진, 취미
                
                
                2. 재화 또는 서비스 제공
                ,필수항목 : 성명, 전화번호, 성별, 직업, 신용카드번호, 은행계좌정보 등 결제정보
                ,선택항목 : 관심분야, 과거 구매내역
                
                3. 애플리케이션 서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다.
                IP주소, 쿠키, MAC주소, 서비스 이용기록, 방문기록, 불량 이용기록 등
                
                제6조(개인정보의 파기) ① 회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체 없이 해당 개인정보를 파기합니다.
                ② 정보주체로부터 동의 받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관 장소를 달리하여 보존합니다.
                ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
                1. 파기절차
                회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
                2. 파기방법
                회사는 전자적 파일 형태로 기록,저장된 개인정보는 기록을 재생할 수 없도록 로우레밸포멧(Low Level Format) 등의 방법을 이용하여 파기하며, 종이 문서에 기록,저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
                
                제7조(개인정보의 안전성 확보조치) 회사는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
                1. 관리적 조치 : 내부관리계획 수립,시행, 정기적 직원 교육 등
                2. 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
                3. 물리적 조치 : 전산실, 자료보관실 등의 접근통제
                
                제8조(개인정보 자동 수집 장치의 설치,운영 및 거부에 관한 사항) 회사는 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.`
            };
            setTerms(newTerms);
        }
        else{
            getTerms();
        }
    },[popup.termsPopIdx]);


    //약관동의 체크
    const termsCheckHandler = () => {
        let check = "";
            check = "terms"+popup.termsPopIdx;
        if(!popup.termsCheckList.includes('terms'+popup.termsPopIdx)){
            dispatch(termsCheckList([...popup.termsCheckList,check]));
        }
        closePopHandler();
    };



    return(<>
        {Object.keys(terms).length > 0 &&
            <div className="flex_center pop_wrap terms_pop">
                <div className="dim" onClick={closePopHandler}></div>
                <div className="pop_cont">
                    <button type="button" className="btn_close black" onClick={closePopHandler}>닫기버튼</button>
                    <div className="pop_tit">
                        <div className="tit">{terms.subject} (필수)</div>
                    </div>
                    <div className="scroll_wrap">
                        <div className="txt_box">{terms.contents_p}</div>
                    </div>
                    <button type="button" className="btn_type3" onClick={termsCheckHandler}>동의</button>
                </div>
            </div>
        }

        {/* confirm팝업 */}
        {confirm && <ConfirmPop />}
    </>);
};

export default TermsPop;